
flappybird:     file format elf64-x86-64


Disassembly of section .init:

0000000000001000 <_init>:
    1000:	f3 0f 1e fa          	endbr64 
    1004:	48 83 ec 08          	sub    $0x8,%rsp
    1008:	48 8b 05 d9 3f 00 00 	mov    0x3fd9(%rip),%rax        # 4fe8 <__gmon_start__@Base>
    100f:	48 85 c0             	test   %rax,%rax
    1012:	74 02                	je     1016 <_init+0x16>
    1014:	ff d0                	call   *%rax
    1016:	48 83 c4 08          	add    $0x8,%rsp
    101a:	c3                   	ret    

Disassembly of section .plt:

0000000000001020 <.plt>:
    1020:	ff 35 8a 3e 00 00    	push   0x3e8a(%rip)        # 4eb0 <_GLOBAL_OFFSET_TABLE_+0x8>
    1026:	f2 ff 25 8b 3e 00 00 	bnd jmp *0x3e8b(%rip)        # 4eb8 <_GLOBAL_OFFSET_TABLE_+0x10>
    102d:	0f 1f 00             	nopl   (%rax)
    1030:	f3 0f 1e fa          	endbr64 
    1034:	68 00 00 00 00       	push   $0x0
    1039:	f2 e9 e1 ff ff ff    	bnd jmp 1020 <_init+0x20>
    103f:	90                   	nop
    1040:	f3 0f 1e fa          	endbr64 
    1044:	68 01 00 00 00       	push   $0x1
    1049:	f2 e9 d1 ff ff ff    	bnd jmp 1020 <_init+0x20>
    104f:	90                   	nop
    1050:	f3 0f 1e fa          	endbr64 
    1054:	68 02 00 00 00       	push   $0x2
    1059:	f2 e9 c1 ff ff ff    	bnd jmp 1020 <_init+0x20>
    105f:	90                   	nop
    1060:	f3 0f 1e fa          	endbr64 
    1064:	68 03 00 00 00       	push   $0x3
    1069:	f2 e9 b1 ff ff ff    	bnd jmp 1020 <_init+0x20>

    <1f7>   DW_AT_decl_file   : 6
    <1f8>   DW_AT_decl_line   : 44
    <1f9>   DW_AT_decl_column : 25
    <1fa>   DW_AT_type        : <0xe3>
 <1><1fe>: Abbrev Number: 5 (DW_TAG_typedef)
    <1ff>   DW_AT_name        : (indirect string, offset: 0x34a): int_least32_t
    <203>   DW_AT_decl_file   : 6
    <204>   DW_AT_decl_line   : 45
    <205>   DW_AT_decl_column : 25
    <206>   DW_AT_type        : <0xfb>
 <1><20a>: Abbrev Number: 5 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0xb36): int_least64_t
    <20f>   DW_AT_decl_file   : 6
    <210>   DW_AT_decl_line   : 46
    <211>   DW_AT_decl_column : 25
    <212>   DW_AT_type        : <0x113>
 <1><216>: Abbrev Number: 5 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0x378): uint_least8_t
    <21b>   DW_AT_decl_file   : 6
    <21c>   DW_AT_decl_line   : 49
    <21d>   DW_AT_decl_column : 25
    <21e>   DW_AT_type        : <0xd7>
 <1><222>: Abbrev Number: 5 (DW_TAG_typedef)
    <223>   DW_AT_name        : (indirect string, offset: 0xe48): uint_least16_t
    <227>   DW_AT_decl_file   : 6
    <228>   DW_AT_decl_line   : 50
    <229>   DW_AT_decl_column : 26
    <22a>   DW_AT_type        : <0xef>
 <1><22e>: Abbrev Number: 5 (DW_TAG_typedef)
    <22f>   DW_AT_name        : (indirect string, offset: 0x6a9): uint_least32_t
    <233>   DW_AT_decl_file   : 6
    <234>   DW_AT_decl_line   : 51
    <235>   DW_AT_decl_column : 26
    <236>   DW_AT_type        : <0x107>
 <1><23a>: Abbrev Number: 5 (DW_TAG_typedef)
    <23b>   DW_AT_name        : (indirect string, offset: 0x1001): uint_least64_t
    <23f>   DW_AT_decl_file   : 6
    <240>   DW_AT_decl_line   : 52
    <241>   DW_AT_decl_column : 26
    <242>   DW_AT_type        : <0x11f>
 <1><246>: Abbrev Number: 5 (DW_TAG_typedef)
    <247>   DW_AT_name        : (indirect string, offset: 0xfd3): int_fast8_t
    <24b>   DW_AT_decl_file   : 6
    <24c>   DW_AT_decl_line   : 58
    <24d>   DW_AT_decl_column : 22
    <24e>   DW_AT_type        : <0x56>
 <1><252>: Abbrev Number: 5 (DW_TAG_typedef)
    <253>   DW_AT_name        : (indirect string, offset: 0x19): int_fast16_t
    <257>   DW_AT_decl_file   : 6
    <258>   DW_AT_decl_line   : 60
    <259>   DW_AT_decl_column : 19
    <25a>   DW_AT_type        : <0xb8>
 <1><25e>: Abbrev Number: 5 (DW_TAG_typedef)
    <25f>   DW_AT_name        : (indirect string, offset: 0x9fd): int_fast32_t
    <263>   DW_AT_decl_file   : 6
    <264>   DW_AT_decl_line   : 61
    <265>   DW_AT_decl_column : 19
    <266>   DW_AT_type        : <0xb8>
 <1><26a>: Abbrev Number: 5 (DW_TAG_typedef)
    <26b>   DW_AT_name        : (indirect string, offset: 0x2bb): int_fast64_t
    <26f>   DW_AT_decl_file   : 6
    <270>   DW_AT_decl_line   : 62
    <271>   DW_AT_decl_column : 19
    <272>   DW_AT_type        : <0xb8>
 <1><276>: Abbrev Number: 5 (DW_TAG_typedef)
    <277>   DW_AT_name        : (indirect string, offset: 0xfd2): uint_fast8_t
    <27b>   DW_AT_decl_file   : 6
    <27c>   DW_AT_decl_line   : 71
    <27d>   DW_AT_decl_column : 24
    <27e>   DW_AT_type        : <0x2e>
 <1><282>: Abbrev Number: 5 (DW_TAG_typedef)
    <283>   DW_AT_name        : (indirect string, offset: 0x18): uint_fast16_t
    <287>   DW_AT_decl_file   : 6
    <288>   DW_AT_decl_line   : 73
    <289>   DW_AT_decl_column : 27
    <28a>   DW_AT_type        : <0x43>
 <1><28e>: Abbrev Number: 5 (DW_TAG_typedef)
    <28f>   DW_AT_name        : (indirect string, offset: 0x9fc): uint_fast32_t
    <293>   DW_AT_decl_file   : 6
    <294>   DW_AT_decl_line   : 74
    <295>   DW_AT_decl_column : 27
    <296>   DW_AT_type        : <0x43>
 <1><29a>: Abbrev Number: 5 (DW_TAG_typedef)
    <29b>   DW_AT_name        : (indirect string, offset: 0x2ba): uint_fast64_t
    <29f>   DW_AT_decl_file   : 6
    <2a0>   DW_AT_decl_line   : 75
    <2a1>   DW_AT_decl_column : 27
    <2a2>   DW_AT_type        : <0x43>
 <1><2a6>: Abbrev Number: 5 (DW_TAG_typedef)
    <2a7>   DW_AT_name        : (indirect string, offset: 0xe3d): intptr_t
    <2ab>   DW_AT_decl_file   : 6
    <2ac>   DW_AT_decl_line   : 87
    <2ad>   DW_AT_decl_column : 19
    <2ae>   DW_AT_type        : <0xb8>
 <1><2b2>: Abbrev Number: 5 (DW_TAG_typedef)
    <2b3>   DW_AT_name        : (indirect string, offset: 0xe3c): uintptr_t
    <2b7>   DW_AT_decl_file   : 6
    <2b8>   DW_AT_decl_line   : 90
    <2b9>   DW_AT_decl_column : 27
    <2ba>   DW_AT_type        : <0x43>
 <1><2be>: Abbrev Number: 5 (DW_TAG_typedef)
    <2bf>   DW_AT_name        : (indirect string, offset: 0xab1): intmax_t
    <2c3>   DW_AT_decl_file   : 6
    <2c4>   DW_AT_decl_line   : 101
    <2c5>   DW_AT_decl_column : 21
    <2c6>   DW_AT_type        : <0x12b>
 <1><2ca>: Abbrev Number: 5 (DW_TAG_typedef)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x2e3): uintmax_t
    <2cf>   DW_AT_decl_file   : 6
    <2d0>   DW_AT_decl_line   : 102
    <2d1>   DW_AT_decl_column : 22
    <2d2>   DW_AT_type        : <0x137>
 <1><2d6>: Abbrev Number: 5 (DW_TAG_typedef)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x9a9): chtype
    <2db>   DW_AT_decl_file   : 7
    <2dc>   DW_AT_decl_line   : 222
    <2dd>   DW_AT_decl_column : 18
    <2de>   DW_AT_type        : <0x3c>
 <1><2e2>: Abbrev Number: 5 (DW_TAG_typedef)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x667): size_t
    <2e7>   DW_AT_decl_file   : 8
    <2e8>   DW_AT_decl_line   : 209
    <2e9>   DW_AT_decl_column : 23
    <2ea>   DW_AT_type        : <0x43>
 <1><2ee>: Abbrev Number: 55 (DW_TAG_structure_type)
    <2ef>   DW_AT_name        : (indirect string, offset: 0xc93): typedef __va_list_tag __va_list_tag
    <2f3>   DW_AT_byte_size   : 24
    <2f4>   DW_AT_decl_file   : 9
    <2f5>   DW_AT_decl_line   : 0
    <2f6>   DW_AT_sibling     : <0x323>
 <2><2fa>: Abbrev Number: 27 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x19a): gp_offset
    <2ff>   DW_AT_decl_file   : 9
    <2ff>   DW_AT_decl_line   : 0
    <2ff>   DW_AT_type        : <0x3c>
    <303>   DW_AT_data_member_location: 0
 <2><304>: Abbrev Number: 27 (DW_TAG_member)
    <305>   DW_AT_name        : (indirect string, offset: 0xd48): fp_offset
    <309>   DW_AT_decl_file   : 9
    <309>   DW_AT_decl_line   : 0
    <309>   DW_AT_type        : <0x3c>
    <30d>   DW_AT_data_member_location: 4
 <2><30e>: Abbrev Number: 27 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x715): overflow_arg_area
    <313>   DW_AT_decl_file   : 9
    <313>   DW_AT_decl_line   : 0
    <313>   DW_AT_type        : <0x173>
    <317>   DW_AT_data_member_location: 8
 <2><318>: Abbrev Number: 27 (DW_TAG_member)
    <319>   DW_AT_name        : (indirect string, offset: 0xe84): reg_save_area
    <31d>   DW_AT_decl_file   : 9
    <31d>   DW_AT_decl_line   : 0
    <31d>   DW_AT_type        : <0x173>
    <321>   DW_AT_data_member_location: 16
 <2><322>: Abbrev Number: 0
 <1><323>: Abbrev Number: 28 (DW_TAG_structure_type)
    <324>   DW_AT_byte_size   : 8
    <325>   DW_AT_decl_file   : 10
    <326>   DW_AT_decl_line   : 14
    <327>   DW_AT_decl_column : 1
    <328>   DW_AT_linkage_name: (indirect string, offset: 0xc63): 11__mbstate_t
    <32c>   DW_AT_sibling     : <0x36b>
 <2><330>: Abbrev Number: 56 (DW_TAG_union_type)
    <331>   DW_AT_byte_size   : 4
    <332>   DW_AT_decl_file   : 10
    <333>   DW_AT_decl_line   : 17
    <334>   DW_AT_decl_column : 3
    <335>   DW_AT_sibling     : <0x350>
 <3><339>: Abbrev Number: 39 (DW_TAG_member)
    <33a>   DW_AT_name        : (indirect string, offset: 0x80a): __wch
    <33e>   DW_AT_decl_file   : 10
    <33e>   DW_AT_decl_line   : 18
    <33f>   DW_AT_decl_column : 19
    <340>   DW_AT_type        : <0x3c>
 <3><344>: Abbrev Number: 39 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0xcdc): __wchb
    <349>   DW_AT_decl_file   : 10
    <349>   DW_AT_decl_line   : 19
    <34a>   DW_AT_decl_column : 10
    <34b>   DW_AT_type        : <0x36b>
 <3><34f>: Abbrev Number: 0
 <2><350>: Abbrev Number: 4 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x3aa): __count
    <355>   DW_AT_decl_file   : 10
    <356>   DW_AT_decl_line   : 15
    <357>   DW_AT_decl_column : 7
    <358>   DW_AT_type        : <0x99>
    <35c>   DW_AT_data_member_location: 0
 <2><35d>: Abbrev Number: 4 (DW_TAG_member)
    <35e>   DW_AT_name        : (indirect string, offset: 0x74f): __value
    <362>   DW_AT_decl_file   : 10
    <363>   DW_AT_decl_line   : 20
    <364>   DW_AT_decl_column : 5
    <365>   DW_AT_type        : <0x330>
    <369>   DW_AT_data_member_location: 4
 <2><36a>: Abbrev Number: 0
 <1><36b>: Abbrev Number: 24 (DW_TAG_array_type)
    <36c>   DW_AT_type        : <0x17a>
    <370>   DW_AT_sibling     : <0x37b>
 <2><374>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <375>   DW_AT_type        : <0x43>
    <379>   DW_AT_upper_bound : 3
 <2><37a>: Abbrev Number: 0
 <1><37b>: Abbrev Number: 5 (DW_TAG_typedef)
    <37c>   DW_AT_name        : (indirect string, offset: 0xc65): __mbstate_t
    <380>   DW_AT_decl_file   : 10
    <381>   DW_AT_decl_line   : 21
    <382>   DW_AT_decl_column : 3
    <383>   DW_AT_type        : <0x323>
 <1><387>: Abbrev Number: 32 (DW_TAG_structure_type)
    <388>   DW_AT_name        : (indirect string, offset: 0xe0a): _G_fpos_t
    <38c>   DW_AT_byte_size   : 16
    <38d>   DW_AT_decl_file   : 11
    <38e>   DW_AT_decl_line   : 10
    <38f>   DW_AT_decl_column : 16
    <390>   DW_AT_sibling     : <0x3af>
 <2><394>: Abbrev Number: 4 (DW_TAG_member)
    <395>   DW_AT_name        : (indirect string, offset: 0x857): __pos
    <399>   DW_AT_decl_file   : 11
    <39a>   DW_AT_decl_line   : 12
    <39b>   DW_AT_decl_column : 11
    <39c>   DW_AT_type        : <0x143>
    <3a0>   DW_AT_data_member_location: 0
 <2><3a1>: Abbrev Number: 4 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x3d1): __state
    <3a6>   DW_AT_decl_file   : 11
    <3a7>   DW_AT_decl_line   : 13
    <3a8>   DW_AT_decl_column : 15
    <3a9>   DW_AT_type        : <0x37b>
    <3ad>   DW_AT_data_member_location: 8
 <2><3ae>: Abbrev Number: 0
 <1><3af>: Abbrev Number: 5 (DW_TAG_typedef)
    <3b0>   DW_AT_name        : (indirect string, offset: 0xa96): __fpos_t
    <3b4>   DW_AT_decl_file   : 11
    <3b5>   DW_AT_decl_line   : 14
    <3b6>   DW_AT_decl_column : 3
    <3b7>   DW_AT_type        : <0x387>
 <1><3bb>: Abbrev Number: 5 (DW_TAG_typedef)
    <3bc>   DW_AT_name        : (indirect string, offset: 0x5c1): __FILE
    <3c0>   DW_AT_decl_file   : 12
    <3c1>   DW_AT_decl_line   : 5
    <3c2>   DW_AT_decl_column : 25
    <3c3>   DW_AT_type        : <0x3c7>
 <1><3c7>: Abbrev Number: 32 (DW_TAG_structure_type)
    <3c8>   DW_AT_name        : (indirect string, offset: 0xe74): _IO_FILE
    <3cc>   DW_AT_byte_size   : 216
    <3cd>   DW_AT_decl_file   : 13
    <3ce>   DW_AT_decl_line   : 49
    <3cf>   DW_AT_decl_column : 8
    <3d0>   DW_AT_sibling     : <0x54e>
 <2><3d4>: Abbrev Number: 4 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x3d9): _flags
    <3d9>   DW_AT_decl_file   : 13
    <3da>   DW_AT_decl_line   : 51
    <3db>   DW_AT_decl_column : 7
    <3dc>   DW_AT_type        : <0x99>
    <3e0>   DW_AT_data_member_location: 0
 <2><3e1>: Abbrev Number: 4 (DW_TAG_member)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x11a0): _IO_read_ptr
    <3e6>   DW_AT_decl_file   : 13
    <3e7>   DW_AT_decl_line   : 54
    <3e8>   DW_AT_decl_column : 9
    <3e9>   DW_AT_type        : <0x175>
    <3ed>   DW_AT_data_member_location: 8
 <2><3ee>: Abbrev Number: 4 (DW_TAG_member)
    <3ef>   DW_AT_name        : (indirect string, offset: 0xb73): _IO_read_end
    <3f3>   DW_AT_decl_file   : 13
    <3f4>   DW_AT_decl_line   : 55
    <3f5>   DW_AT_decl_column : 9
    <3f6>   DW_AT_type        : <0x175>
    <3fa>   DW_AT_data_member_location: 16
 <2><3fb>: Abbrev Number: 4 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x699): _IO_read_base
    <400>   DW_AT_decl_file   : 13
    <401>   DW_AT_decl_line   : 56
    <402>   DW_AT_decl_column : 9
    <403>   DW_AT_type        : <0x175>
    <407>   DW_AT_data_member_location: 24
 <2><408>: Abbrev Number: 4 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0x7d7): _IO_write_base
    <40d>   DW_AT_decl_file   : 13
    <40e>   DW_AT_decl_line   : 57
    <40f>   DW_AT_decl_column : 9
    <410>   DW_AT_type        : <0x175>
    <414>   DW_AT_data_member_location: 32
 <2><415>: Abbrev Number: 4 (DW_TAG_member)
    <416>   DW_AT_name        : (indirect string, offset: 0xfa3): _IO_write_ptr
    <41a>   DW_AT_decl_file   : 13
    <41b>   DW_AT_decl_line   : 58
    <41c>   DW_AT_decl_column : 9
    <41d>   DW_AT_type        : <0x175>
    <421>   DW_AT_data_member_location: 40
 <2><422>: Abbrev Number: 4 (DW_TAG_member)
    <423>   DW_AT_name        : (indirect string, offset: 0x258): _IO_write_end
    <427>   DW_AT_decl_file   : 13
    <428>   DW_AT_decl_line   : 59
    <429>   DW_AT_decl_column : 9
    <42a>   DW_AT_type        : <0x175>
    <42e>   DW_AT_data_member_location: 48
 <2><42f>: Abbrev Number: 4 (DW_TAG_member)
    <430>   DW_AT_name        : (indirect string, offset: 0x12aa): _IO_buf_base
    <434>   DW_AT_decl_file   : 13
    <435>   DW_AT_decl_line   : 60
    <436>   DW_AT_decl_column : 9
    <437>   DW_AT_type        : <0x175>
    <43b>   DW_AT_data_member_location: 56
 <2><43c>: Abbrev Number: 4 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x36a): _IO_buf_end
    <441>   DW_AT_decl_file   : 13
    <442>   DW_AT_decl_line   : 61
    <443>   DW_AT_decl_column : 9
    <444>   DW_AT_type        : <0x175>
    <448>   DW_AT_data_member_location: 64
 <2><449>: Abbrev Number: 4 (DW_TAG_member)
    <44a>   DW_AT_name        : (indirect string, offset: 0x8df): _IO_save_base
    <44e>   DW_AT_decl_file   : 13
    <44f>   DW_AT_decl_line   : 64
    <450>   DW_AT_decl_column : 9
    <451>   DW_AT_type        : <0x175>
    <455>   DW_AT_data_member_location: 72
 <2><456>: Abbrev Number: 4 (DW_TAG_member)
    <457>   DW_AT_name        : (indirect string, offset: 0x5c8): _IO_backup_base
    <45b>   DW_AT_decl_file   : 13
    <45c>   DW_AT_decl_line   : 65
    <45d>   DW_AT_decl_column : 9
    <45e>   DW_AT_type        : <0x175>
    <462>   DW_AT_data_member_location: 80
 <2><463>: Abbrev Number: 4 (DW_TAG_member)
    <464>   DW_AT_name        : (indirect string, offset: 0x491): _IO_save_end
    <468>   DW_AT_decl_file   : 13
    <469>   DW_AT_decl_line   : 66
    <46a>   DW_AT_decl_column : 9
    <46b>   DW_AT_type        : <0x175>
    <46f>   DW_AT_data_member_location: 88
 <2><470>: Abbrev Number: 4 (DW_TAG_member)
    <471>   DW_AT_name        : (indirect string, offset: 0x30b): _markers
    <475>   DW_AT_decl_file   : 13
    <476>   DW_AT_decl_line   : 68
    <477>   DW_AT_decl_column : 22
    <478>   DW_AT_type        : <0x567>
    <47c>   DW_AT_data_member_location: 96
 <2><47d>: Abbrev Number: 4 (DW_TAG_member)
    <47e>   DW_AT_name        : (indirect string, offset: 0x11f3): _chain
    <482>   DW_AT_decl_file   : 13
    <483>   DW_AT_decl_line   : 70
    <484>   DW_AT_decl_column : 20
    <485>   DW_AT_type        : <0x56c>
    <489>   DW_AT_data_member_location: 104
 <2><48a>: Abbrev Number: 4 (DW_TAG_member)
    <48b>   DW_AT_name        : (indirect string, offset: 0x109d): _fileno
    <48f>   DW_AT_decl_file   : 13
    <490>   DW_AT_decl_line   : 72
    <491>   DW_AT_decl_column : 7
    <492>   DW_AT_type        : <0x99>
    <496>   DW_AT_data_member_location: 112
 <2><497>: Abbrev Number: 4 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x124b): _flags2
    <49c>   DW_AT_decl_file   : 13
    <49d>   DW_AT_decl_line   : 73
    <49e>   DW_AT_decl_column : 7
    <49f>   DW_AT_type        : <0x99>
    <4a3>   DW_AT_data_member_location: 116
 <2><4a4>: Abbrev Number: 4 (DW_TAG_member)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x2f9): _old_offset
    <4a9>   DW_AT_decl_file   : 13
    <4aa>   DW_AT_decl_line   : 74
    <4ab>   DW_AT_decl_column : 11
    <4ac>   DW_AT_type        : <0x143>
    <4b0>   DW_AT_data_member_location: 120
 <2><4b1>: Abbrev Number: 4 (DW_TAG_member)
    <4b2>   DW_AT_name        : (indirect string, offset: 0x4e9): _cur_column
    <4b6>   DW_AT_decl_file   : 13
    <4b7>   DW_AT_decl_line   : 77
    <4b8>   DW_AT_decl_column : 18
    <4b9>   DW_AT_type        : <0x35>
    <4bd>   DW_AT_data_member_location: 128
 <2><4be>: Abbrev Number: 4 (DW_TAG_member)
    <4bf>   DW_AT_name        : (indirect string, offset: 0xa62): _vtable_offset
    <4c3>   DW_AT_decl_file   : 13
    <4c4>   DW_AT_decl_line   : 78
    <4c5>   DW_AT_decl_column : 15
    <4c6>   DW_AT_type        : <0x56>
    <4ca>   DW_AT_data_member_location: 130
 <2><4cb>: Abbrev Number: 4 (DW_TAG_member)
    <4cc>   DW_AT_name        : (indirect string, offset: 0xdc): _shortbuf
    <4d0>   DW_AT_decl_file   : 13
    <4d1>   DW_AT_decl_line   : 79
    <4d2>   DW_AT_decl_column : 8
    <4d3>   DW_AT_type        : <0x571>
    <4d7>   DW_AT_data_member_location: 131
 <2><4d8>: Abbrev Number: 4 (DW_TAG_member)
    <4d9>   DW_AT_name        : (indirect string, offset: 0xe57): _lock
    <4dd>   DW_AT_decl_file   : 13
    <4de>   DW_AT_decl_line   : 81
    <4df>   DW_AT_decl_column : 15
    <4e0>   DW_AT_type        : <0x581>
    <4e4>   DW_AT_data_member_location: 136
 <2><4e5>: Abbrev Number: 4 (DW_TAG_member)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x2fd): _offset
    <4ea>   DW_AT_decl_file   : 13
    <4eb>   DW_AT_decl_line   : 89
    <4ec>   DW_AT_decl_column : 13
    <4ed>   DW_AT_type        : <0x14f>
    <4f1>   DW_AT_data_member_location: 144
 <2><4f2>: Abbrev Number: 4 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x50a): _codecvt
    <4f7>   DW_AT_decl_file   : 13
    <4f8>   DW_AT_decl_line   : 91
    <4f9>   DW_AT_decl_column : 23
    <4fa>   DW_AT_type        : <0x58b>
    <4fe>   DW_AT_data_member_location: 152
 <2><4ff>: Abbrev Number: 4 (DW_TAG_member)
    <500>   DW_AT_name        : (indirect string, offset: 0xcc3): _wide_data
    <504>   DW_AT_decl_file   : 13
    <505>   DW_AT_decl_line   : 92
    <506>   DW_AT_decl_column : 25
    <507>   DW_AT_type        : <0x595>
    <50b>   DW_AT_data_member_location: 160
 <2><50c>: Abbrev Number: 4 (DW_TAG_member)
    <50d>   DW_AT_name        : (indirect string, offset: 0x270): _freeres_list
    <511>   DW_AT_decl_file   : 13
    <512>   DW_AT_decl_line   : 93
    <513>   DW_AT_decl_column : 20
    <514>   DW_AT_type        : <0x56c>
    <518>   DW_AT_data_member_location: 168
 <2><519>: Abbrev Number: 4 (DW_TAG_member)
    <51a>   DW_AT_name        : (indirect string, offset: 0x9c1): _freeres_buf
    <51e>   DW_AT_decl_file   : 13
    <51f>   DW_AT_decl_line   : 94
    <520>   DW_AT_decl_column : 9
    <521>   DW_AT_type        : <0x173>
    <525>   DW_AT_data_member_location: 176
 <2><526>: Abbrev Number: 4 (DW_TAG_member)
    <527>   DW_AT_name        : (indirect string, offset: 0xa1c): __pad5
    <52b>   DW_AT_decl_file   : 13
    <52c>   DW_AT_decl_line   : 95
    <52d>   DW_AT_decl_column : 10
    <52e>   DW_AT_type        : <0x2e2>
    <532>   DW_AT_data_member_location: 184
 <2><533>: Abbrev Number: 4 (DW_TAG_member)
    <534>   DW_AT_name        : (indirect string, offset: 0x795): _mode
    <538>   DW_AT_decl_file   : 13
    <539>   DW_AT_decl_line   : 96
    <53a>   DW_AT_decl_column : 7
    <53b>   DW_AT_type        : <0x99>
    <53f>   DW_AT_data_member_location: 192
 <2><540>: Abbrev Number: 4 (DW_TAG_member)
    <541>   DW_AT_name        : (indirect string, offset: 0x12a1): _unused2
    <545>   DW_AT_decl_file   : 13
    <546>   DW_AT_decl_line   : 98
    <547>   DW_AT_decl_column : 8
    <548>   DW_AT_type        : <0x59a>
    <54c>   DW_AT_data_member_location: 196
 <2><54d>: Abbrev Number: 0
 <1><54e>: Abbrev Number: 5 (DW_TAG_typedef)
    <54f>   DW_AT_name        : (indirect string, offset: 0xe78): FILE
    <553>   DW_AT_decl_file   : 14
    <554>   DW_AT_decl_line   : 7
    <555>   DW_AT_decl_column : 25
    <556>   DW_AT_type        : <0x3c7>
 <1><55a>: Abbrev Number: 57 (DW_TAG_typedef)
    <55b>   DW_AT_name        : (indirect string, offset: 0xe6): _IO_lock_t
    <55f>   DW_AT_decl_file   : 13
    <560>   DW_AT_decl_line   : 43
    <561>   DW_AT_decl_column : 14
 <1><562>: Abbrev Number: 29 (DW_TAG_structure_type)
    <563>   DW_AT_name        : (indirect string, offset: 0x7c6): _IO_marker
    <567>   DW_AT_declaration : 1
 <1><567>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <568>   DW_AT_byte_size   : 8
    <568>   DW_AT_type        : <0x562>
 <1><56c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <56d>   DW_AT_byte_size   : 8
    <56d>   DW_AT_type        : <0x3c7>
 <1><571>: Abbrev Number: 24 (DW_TAG_array_type)
    <572>   DW_AT_type        : <0x17a>
    <576>   DW_AT_sibling     : <0x581>
 <2><57a>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <57b>   DW_AT_type        : <0x43>
    <57f>   DW_AT_upper_bound : 0
 <2><580>: Abbrev Number: 0
 <1><581>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <582>   DW_AT_byte_size   : 8
    <582>   DW_AT_type        : <0x55a>
 <1><586>: Abbrev Number: 29 (DW_TAG_structure_type)
    <587>   DW_AT_name        : (indirect string, offset: 0x507): _IO_codecvt
    <58b>   DW_AT_declaration : 1
 <1><58b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <58c>   DW_AT_byte_size   : 8
    <58c>   DW_AT_type        : <0x586>
 <1><590>: Abbrev Number: 29 (DW_TAG_structure_type)
    <591>   DW_AT_name        : (indirect string, offset: 0xcc0): _IO_wide_data
    <595>   DW_AT_declaration : 1
 <1><595>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <596>   DW_AT_byte_size   : 8
    <596>   DW_AT_type        : <0x590>
 <1><59a>: Abbrev Number: 24 (DW_TAG_array_type)
    <59b>   DW_AT_type        : <0x17a>
    <59f>   DW_AT_sibling     : <0x5aa>
 <2><5a3>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <5a4>   DW_AT_type        : <0x43>
    <5a8>   DW_AT_upper_bound : 19
 <2><5a9>: Abbrev Number: 0
 <1><5aa>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5ab>   DW_AT_byte_size   : 8
    <5ab>   DW_AT_type        : <0x181>
 <1><5af>: Abbrev Number: 5 (DW_TAG_typedef)
    <5b0>   DW_AT_name        : (indirect string, offset: 0xe0d): fpos_t
    <5b4>   DW_AT_decl_file   : 15
    <5b5>   DW_AT_decl_line   : 84
    <5b6>   DW_AT_decl_column : 18
    <5b7>   DW_AT_type        : <0x3af>
 <1><5bb>: Abbrev Number: 14 (DW_TAG_const_type)
    <5bc>   DW_AT_type        : <0x5af>
 <1><5c0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5c1>   DW_AT_byte_size   : 8
    <5c1>   DW_AT_type        : <0x54e>
 <1><5c5>: Abbrev Number: 10 (DW_TAG_base_type)
    <5c6>   DW_AT_byte_size   : 32
    <5c7>   DW_AT_encoding    : 3	(complex float)
    <5c8>   DW_AT_name        : (indirect string, offset: 0xa0a): __unknown__
 <1><5cc>: Abbrev Number: 10 (DW_TAG_base_type)
    <5cd>   DW_AT_byte_size   : 16
    <5ce>   DW_AT_encoding    : 4	(float)
    <5cf>   DW_AT_name        : (indirect string, offset: 0x6d9): __float128
 <1><5d3>: Abbrev Number: 10 (DW_TAG_base_type)
    <5d4>   DW_AT_byte_size   : 4
    <5d5>   DW_AT_encoding    : 4	(float)
    <5d6>   DW_AT_name        : (indirect string, offset: 0x4d6): float
 <1><5da>: Abbrev Number: 10 (DW_TAG_base_type)
    <5db>   DW_AT_byte_size   : 8
    <5dc>   DW_AT_encoding    : 4	(float)
    <5dd>   DW_AT_name        : (indirect string, offset: 0xabf): double
 <1><5e1>: Abbrev Number: 10 (DW_TAG_base_type)
    <5e2>   DW_AT_byte_size   : 16
    <5e3>   DW_AT_encoding    : 4	(float)
    <5e4>   DW_AT_name        : (indirect string, offset: 0xaba): long double
 <1><5e8>: Abbrev Number: 10 (DW_TAG_base_type)
    <5e9>   DW_AT_byte_size   : 8
    <5ea>   DW_AT_encoding    : 5	(signed)
    <5eb>   DW_AT_name        : (indirect string, offset: 0x8ba): long long int
 <1><5ef>: Abbrev Number: 58 (DW_TAG_unspecified_type)
    <5f0>   DW_AT_name        : (indirect string, offset: 0x358): decltype(nullptr)
 <1><5f4>: Abbrev Number: 26 (DW_TAG_typedef)
    <5f5>   DW_AT_name        : (indirect string, offset: 0x12c9): WINDOW
    <5f9>   DW_AT_decl_file   : 7
    <5fa>   DW_AT_decl_line   : 442
    <5fc>   DW_AT_decl_column : 24
    <5fd>   DW_AT_type        : <0x601>
 <1><601>: Abbrev Number: 40 (DW_TAG_structure_type)
    <602>   DW_AT_name        : (indirect string, offset: 0xd1b): _win_st
    <606>   DW_AT_byte_size   : 120
    <607>   DW_AT_decl_file   : 7
    <607>   DW_AT_decl_line   : 491
    <609>   DW_AT_decl_column : 8
    <60a>   DW_AT_sibling     : <0x7e4>
 <2><60e>: Abbrev Number: 40 (DW_TAG_structure_type)
    <60f>   DW_AT_name        : (indirect string, offset: 0x675): pdat
    <613>   DW_AT_byte_size   : 12
    <614>   DW_AT_decl_file   : 7
    <614>   DW_AT_decl_line   : 529
    <616>   DW_AT_decl_column : 9
    <617>   DW_AT_sibling     : <0x66a>
 <3><61b>: Abbrev Number: 6 (DW_TAG_member)
    <61c>   DW_AT_name        : (indirect string, offset: 0x113b): _pad_y
    <620>   DW_AT_decl_file   : 7
    <620>   DW_AT_decl_line   : 531
    <622>   DW_AT_decl_column : 21
    <623>   DW_AT_type        : <0x75>
    <627>   DW_AT_data_member_location: 0
 <3><628>: Abbrev Number: 6 (DW_TAG_member)
    <629>   DW_AT_name        : (indirect string, offset: 0x1044): _pad_x
    <62d>   DW_AT_decl_file   : 7
    <62d>   DW_AT_decl_line   : 531
    <62f>   DW_AT_decl_column : 34
    <630>   DW_AT_type        : <0x75>
    <634>   DW_AT_data_member_location: 2
 <3><635>: Abbrev Number: 6 (DW_TAG_member)
    <636>   DW_AT_name        : (indirect string, offset: 0x917): _pad_top
    <63a>   DW_AT_decl_file   : 7
    <63a>   DW_AT_decl_line   : 532
    <63c>   DW_AT_decl_column : 21
    <63d>   DW_AT_type        : <0x75>
    <641>   DW_AT_data_member_location: 4
 <3><642>: Abbrev Number: 6 (DW_TAG_member)
    <643>   DW_AT_name        : (indirect string, offset: 0xbc7): _pad_left
    <647>   DW_AT_decl_file   : 7
    <647>   DW_AT_decl_line   : 532
    <649>   DW_AT_decl_column : 34
    <64a>   DW_AT_type        : <0x75>
    <64e>   DW_AT_data_member_location: 6
 <3><64f>: Abbrev Number: 6 (DW_TAG_member)
    <650>   DW_AT_name        : (indirect string, offset: 0x1253): _pad_bottom
    <654>   DW_AT_decl_file   : 7
    <654>   DW_AT_decl_line   : 533
    <656>   DW_AT_decl_column : 21
    <657>   DW_AT_type        : <0x75>
    <65b>   DW_AT_data_member_location: 8
 <3><65c>: Abbrev Number: 6 (DW_TAG_member)
    <65d>   DW_AT_name        : (indirect string, offset: 0x8c): _pad_right
    <661>   DW_AT_decl_file   : 7
    <661>   DW_AT_decl_line   : 533
    <663>   DW_AT_decl_column : 34
    <664>   DW_AT_type        : <0x75>
    <668>   DW_AT_data_member_location: 10
 <3><669>: Abbrev Number: 0
 <2><66a>: Abbrev Number: 6 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0x1281): _cury
    <66f>   DW_AT_decl_file   : 7
    <66f>   DW_AT_decl_line   : 493
    <671>   DW_AT_decl_column : 17
    <672>   DW_AT_type        : <0x75>
    <676>   DW_AT_data_member_location: 0
 <2><677>: Abbrev Number: 6 (DW_TAG_member)
    <678>   DW_AT_name        : (indirect string, offset: 0x1245): _curx
    <67c>   DW_AT_decl_file   : 7
    <67c>   DW_AT_decl_line   : 493
    <67e>   DW_AT_decl_column : 24
    <67f>   DW_AT_type        : <0x75>
    <683>   DW_AT_data_member_location: 2
 <2><684>: Abbrev Number: 6 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x441): _maxy
    <689>   DW_AT_decl_file   : 7
    <689>   DW_AT_decl_line   : 496
    <68b>   DW_AT_decl_column : 17
    <68c>   DW_AT_type        : <0x75>
    <690>   DW_AT_data_member_location: 4
 <2><691>: Abbrev Number: 6 (DW_TAG_member)
    <692>   DW_AT_name        : (indirect string, offset: 0x43b): _maxx
    <696>   DW_AT_decl_file   : 7
    <696>   DW_AT_decl_line   : 496
    <698>   DW_AT_decl_column : 24
    <699>   DW_AT_type        : <0x75>
    <69d>   DW_AT_data_member_location: 6
 <2><69e>: Abbrev Number: 6 (DW_TAG_member)
    <69f>   DW_AT_name        : (indirect string, offset: 0x125f): _begy
    <6a3>   DW_AT_decl_file   : 7
    <6a3>   DW_AT_decl_line   : 497
    <6a5>   DW_AT_decl_column : 17
    <6a6>   DW_AT_type        : <0x75>
    <6aa>   DW_AT_data_member_location: 8
 <2><6ab>: Abbrev Number: 6 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x661): _begx
    <6b0>   DW_AT_decl_file   : 7
    <6b0>   DW_AT_decl_line   : 497
    <6b2>   DW_AT_decl_column : 24
    <6b3>   DW_AT_type        : <0x75>
    <6b7>   DW_AT_data_member_location: 10
 <2><6b8>: Abbrev Number: 6 (DW_TAG_member)
    <6b9>   DW_AT_name        : (indirect string, offset: 0x3d9): _flags
    <6bd>   DW_AT_decl_file   : 7
    <6bd>   DW_AT_decl_line   : 499
    <6bf>   DW_AT_decl_column : 10
    <6c0>   DW_AT_type        : <0x75>
    <6c4>   DW_AT_data_member_location: 12
 <2><6c5>: Abbrev Number: 6 (DW_TAG_member)
    <6c6>   DW_AT_name        : (indirect string, offset: 0xc78): _attrs
    <6ca>   DW_AT_decl_file   : 7
    <6ca>   DW_AT_decl_line   : 502
    <6cc>   DW_AT_decl_column : 10
    <6cd>   DW_AT_type        : <0x7e4>
    <6d1>   DW_AT_data_member_location: 16
 <2><6d2>: Abbrev Number: 6 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0xbd1): _bkgd
    <6d7>   DW_AT_decl_file   : 7
    <6d7>   DW_AT_decl_line   : 503
    <6d9>   DW_AT_decl_column : 10
    <6da>   DW_AT_type        : <0x2d6>
    <6de>   DW_AT_data_member_location: 20
 <2><6df>: Abbrev Number: 6 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0xd65): _notimeout
    <6e4>   DW_AT_decl_file   : 7
    <6e4>   DW_AT_decl_line   : 506
    <6e6>   DW_AT_decl_column : 7
    <6e7>   DW_AT_type        : <0x86d>
    <6eb>   DW_AT_data_member_location: 24
 <2><6ec>: Abbrev Number: 6 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x67a): _clear
    <6f1>   DW_AT_decl_file   : 7
    <6f1>   DW_AT_decl_line   : 507
    <6f3>   DW_AT_decl_column : 7
    <6f4>   DW_AT_type        : <0x86d>
    <6f8>   DW_AT_data_member_location: 25
 <2><6f9>: Abbrev Number: 6 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0x215): _leaveok
    <6fe>   DW_AT_decl_file   : 7
    <6fe>   DW_AT_decl_line   : 508
    <700>   DW_AT_decl_column : 7
    <701>   DW_AT_type        : <0x86d>
    <705>   DW_AT_data_member_location: 26
 <2><706>: Abbrev Number: 6 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x44e): _scroll
    <70b>   DW_AT_decl_file   : 7
    <70b>   DW_AT_decl_line   : 509
    <70d>   DW_AT_decl_column : 7
    <70e>   DW_AT_type        : <0x86d>
    <712>   DW_AT_data_member_location: 27
 <2><713>: Abbrev Number: 6 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0x644): _idlok
    <718>   DW_AT_decl_file   : 7
    <718>   DW_AT_decl_line   : 510
    <71a>   DW_AT_decl_column : 7
    <71b>   DW_AT_type        : <0x86d>
    <71f>   DW_AT_data_member_location: 28
 <2><720>: Abbrev Number: 6 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0xd23): _idcok
    <725>   DW_AT_decl_file   : 7
    <725>   DW_AT_decl_line   : 511
    <727>   DW_AT_decl_column : 7
    <728>   DW_AT_type        : <0x86d>
    <72c>   DW_AT_data_member_location: 29
 <2><72d>: Abbrev Number: 6 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0x53e): _immed
    <732>   DW_AT_decl_file   : 7
    <732>   DW_AT_decl_line   : 512
    <734>   DW_AT_decl_column : 7
    <735>   DW_AT_type        : <0x86d>
    <739>   DW_AT_data_member_location: 30
 <2><73a>: Abbrev Number: 6 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x8cf): _sync
    <73f>   DW_AT_decl_file   : 7
    <73f>   DW_AT_decl_line   : 513
    <741>   DW_AT_decl_column : 7
    <742>   DW_AT_type        : <0x86d>
    <746>   DW_AT_data_member_location: 31
 <2><747>: Abbrev Number: 6 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x1a4): _use_keypad
    <74c>   DW_AT_decl_file   : 7
    <74c>   DW_AT_decl_line   : 514
    <74e>   DW_AT_decl_column : 7
    <74f>   DW_AT_type        : <0x86d>
    <753>   DW_AT_data_member_location: 32
 <2><754>: Abbrev Number: 6 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0xd04): _delay
    <759>   DW_AT_decl_file   : 7
    <759>   DW_AT_decl_line   : 515
    <75b>   DW_AT_decl_column : 6
    <75c>   DW_AT_type        : <0x99>
    <760>   DW_AT_data_member_location: 36
 <2><761>: Abbrev Number: 6 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x305): _line
    <766>   DW_AT_decl_file   : 7
    <766>   DW_AT_decl_line   : 517
    <768>   DW_AT_decl_column : 15
    <769>   DW_AT_type        : <0x879>
    <76d>   DW_AT_data_member_location: 40
 <2><76e>: Abbrev Number: 6 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x1f2): _regtop
    <773>   DW_AT_decl_file   : 7
    <773>   DW_AT_decl_line   : 520
    <775>   DW_AT_decl_column : 17
    <776>   DW_AT_type        : <0x75>
    <77a>   DW_AT_data_member_location: 48
 <2><77b>: Abbrev Number: 6 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0x3c6): _regbottom
    <780>   DW_AT_decl_file   : 7
    <780>   DW_AT_decl_line   : 521
    <782>   DW_AT_decl_column : 17
    <783>   DW_AT_type        : <0x75>
    <787>   DW_AT_data_member_location: 50
 <2><788>: Abbrev Number: 6 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x97b): _parx
    <78d>   DW_AT_decl_file   : 7
    <78d>   DW_AT_decl_line   : 524
    <78f>   DW_AT_decl_column : 6
    <790>   DW_AT_type        : <0x99>
    <794>   DW_AT_data_member_location: 52
 <2><795>: Abbrev Number: 6 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x981): _pary
    <79a>   DW_AT_decl_file   : 7
    <79a>   DW_AT_decl_line   : 525
    <79c>   DW_AT_decl_column : 6
    <79d>   DW_AT_type        : <0x99>
    <7a1>   DW_AT_data_member_location: 56
 <2><7a2>: Abbrev Number: 6 (DW_TAG_member)
    <7a3>   DW_AT_name        : (indirect string, offset: 0xa9f): _parent
    <7a7>   DW_AT_decl_file   : 7
    <7a7>   DW_AT_decl_line   : 526
    <7a9>   DW_AT_decl_column : 10
    <7aa>   DW_AT_type        : <0x87e>
    <7ae>   DW_AT_data_member_location: 64
 <2><7af>: Abbrev Number: 6 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x5a1): _pad
    <7b4>   DW_AT_decl_file   : 7
    <7b4>   DW_AT_decl_line   : 534
    <7b6>   DW_AT_decl_column : 4
    <7b7>   DW_AT_type        : <0x60e>
    <7bb>   DW_AT_data_member_location: 72
 <2><7bc>: Abbrev Number: 6 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0x62a): _yoffset
    <7c1>   DW_AT_decl_file   : 7
    <7c1>   DW_AT_decl_line   : 536
    <7c3>   DW_AT_decl_column : 17
    <7c4>   DW_AT_type        : <0x75>
    <7c8>   DW_AT_data_member_location: 84
 <2><7c9>: Abbrev Number: 6 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x77a): _bkgrnd
    <7ce>   DW_AT_decl_file   : 7
    <7ce>   DW_AT_decl_line   : 539
    <7d0>   DW_AT_decl_column : 11
    <7d1>   DW_AT_type        : <0x860>
    <7d5>   DW_AT_data_member_location: 88
 <2><7d6>: Abbrev Number: 6 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xad8): _color
    <7db>   DW_AT_decl_file   : 7
    <7db>   DW_AT_decl_line   : 541
    <7dd>   DW_AT_decl_column : 6
    <7de>   DW_AT_type        : <0x99>
    <7e2>   DW_AT_data_member_location: 116
 <2><7e3>: Abbrev Number: 0
 <1><7e4>: Abbrev Number: 26 (DW_TAG_typedef)
    <7e5>   DW_AT_name        : (indirect string, offset: 0x938): attr_t
    <7e9>   DW_AT_decl_file   : 7
    <7ea>   DW_AT_decl_line   : 444
    <7ec>   DW_AT_decl_column : 16
    <7ed>   DW_AT_type        : <0x2d6>
 <1><7f1>: Abbrev Number: 5 (DW_TAG_typedef)
    <7f2>   DW_AT_name        : (indirect string, offset: 0xe7d): wint_t
    <7f6>   DW_AT_decl_file   : 16
    <7f7>   DW_AT_decl_line   : 20
    <7f8>   DW_AT_decl_column : 23
    <7f9>   DW_AT_type        : <0x3c>
 <1><7fd>: Abbrev Number: 5 (DW_TAG_typedef)
    <7fe>   DW_AT_name        : (indirect string, offset: 0xc67): mbstate_t
    <802>   DW_AT_decl_file   : 17
    <803>   DW_AT_decl_line   : 6
    <804>   DW_AT_decl_column : 21
    <805>   DW_AT_type        : <0x37b>
 <1><809>: Abbrev Number: 14 (DW_TAG_const_type)
    <80a>   DW_AT_type        : <0x7fd>
 <1><80e>: Abbrev Number: 59 (DW_TAG_structure_type)
    <80f>   DW_AT_byte_size   : 28
    <810>   DW_AT_decl_file   : 7
    <811>   DW_AT_decl_line   : 475
    <813>   DW_AT_decl_column : 1
    <814>   DW_AT_linkage_name: (indirect string, offset: 0x10d4): 7cchar_t
    <818>   DW_AT_sibling     : <0x844>
 <2><81c>: Abbrev Number: 6 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x5a6): attr
    <821>   DW_AT_decl_file   : 7
    <821>   DW_AT_decl_line   : 476
    <823>   DW_AT_decl_column : 12
    <824>   DW_AT_type        : <0x7e4>
    <828>   DW_AT_data_member_location: 0
 <2><829>: Abbrev Number: 6 (DW_TAG_member)
    <82a>   DW_AT_name        : (indirect string, offset: 0x8fe): chars
    <82e>   DW_AT_decl_file   : 7
    <82e>   DW_AT_decl_line   : 477
    <830>   DW_AT_decl_column : 13
    <831>   DW_AT_type        : <0x844>
    <835>   DW_AT_data_member_location: 4
 <2><836>: Abbrev Number: 6 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0x8d5): ext_color
    <83b>   DW_AT_decl_file   : 7
    <83b>   DW_AT_decl_line   : 481
    <83d>   DW_AT_decl_column : 10
    <83e>   DW_AT_type        : <0x99>
    <842>   DW_AT_data_member_location: 24
 <2><843>: Abbrev Number: 0
 <1><844>: Abbrev Number: 24 (DW_TAG_array_type)
    <845>   DW_AT_type        : <0x854>
    <849>   DW_AT_sibling     : <0x854>
 <2><84d>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <84e>   DW_AT_type        : <0x43>
    <852>   DW_AT_upper_bound : 4
 <2><853>: Abbrev Number: 0
 <1><854>: Abbrev Number: 10 (DW_TAG_base_type)
    <855>   DW_AT_byte_size   : 4
    <856>   DW_AT_encoding    : 5	(signed)
    <857>   DW_AT_name        : (indirect string, offset: 0x2d9): wchar_t
 <1><85b>: Abbrev Number: 14 (DW_TAG_const_type)
    <85c>   DW_AT_type        : <0x854>
 <1><860>: Abbrev Number: 26 (DW_TAG_typedef)
    <861>   DW_AT_name        : (indirect string, offset: 0x10d5): cchar_t
    <865>   DW_AT_decl_file   : 7
    <866>   DW_AT_decl_line   : 484
    <868>   DW_AT_decl_column : 1
    <869>   DW_AT_type        : <0x80e>
 <1><86d>: Abbrev Number: 10 (DW_TAG_base_type)
    <86e>   DW_AT_byte_size   : 1
    <86f>   DW_AT_encoding    : 2	(boolean)
    <870>   DW_AT_name        : (indirect string, offset: 0xdb8): bool
 <1><874>: Abbrev Number: 29 (DW_TAG_structure_type)
    <875>   DW_AT_name        : (indirect string, offset: 0xcb): ldat
    <879>   DW_AT_declaration : 1
 <1><879>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <87a>   DW_AT_byte_size   : 8
    <87a>   DW_AT_type        : <0x874>
 <1><87e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <87f>   DW_AT_byte_size   : 8
    <87f>   DW_AT_type        : <0x5f4>
 <1><883>: Abbrev Number: 60 (DW_TAG_variable)
    <884>   DW_AT_name        : (indirect string, offset: 0xcfd): stdscr
    <888>   DW_AT_decl_file   : 7
    <889>   DW_AT_decl_line   : 1479
    <88b>   DW_AT_decl_column : 37
    <88c>   DW_AT_type        : <0x87e>
    <890>   DW_AT_external    : 1
    <890>   DW_AT_declaration : 1
 <1><890>: Abbrev Number: 28 (DW_TAG_structure_type)
    <891>   DW_AT_byte_size   : 8
    <892>   DW_AT_decl_file   : 18
    <893>   DW_AT_decl_line   : 60
    <894>   DW_AT_decl_column : 3
    <895>   DW_AT_linkage_name: (indirect string, offset: 0x79b): 5div_t
    <899>   DW_AT_sibling     : <0x8b7>
 <2><89d>: Abbrev Number: 4 (DW_TAG_member)
    <89e>   DW_AT_name        : (indirect string, offset: 0x841): quot
    <8a2>   DW_AT_decl_file   : 18
    <8a3>   DW_AT_decl_line   : 61
    <8a4>   DW_AT_decl_column : 9
    <8a5>   DW_AT_type        : <0x99>
    <8a9>   DW_AT_data_member_location: 0
 <2><8aa>: Abbrev Number: 33 (DW_TAG_member)
    <8ab>   DW_AT_name        : rem
    <8af>   DW_AT_decl_file   : 18
    <8af>   DW_AT_decl_line   : 62
    <8b0>   DW_AT_decl_column : 9
    <8b1>   DW_AT_type        : <0x99>
    <8b5>   DW_AT_data_member_location: 4
 <2><8b6>: Abbrev Number: 0
 <1><8b7>: Abbrev Number: 5 (DW_TAG_typedef)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x79c): div_t
    <8bc>   DW_AT_decl_file   : 18
    <8bd>   DW_AT_decl_line   : 63
    <8be>   DW_AT_decl_column : 5
    <8bf>   DW_AT_type        : <0x890>
 <1><8c3>: Abbrev Number: 28 (DW_TAG_structure_type)
    <8c4>   DW_AT_byte_size   : 16
    <8c5>   DW_AT_decl_file   : 18
    <8c6>   DW_AT_decl_line   : 68
    <8c7>   DW_AT_decl_column : 3
    <8c8>   DW_AT_linkage_name: (indirect string, offset: 0xd0b): 6ldiv_t
    <8cc>   DW_AT_sibling     : <0x8ea>
 <2><8d0>: Abbrev Number: 4 (DW_TAG_member)
    <8d1>   DW_AT_name        : (indirect string, offset: 0x841): quot
    <8d5>   DW_AT_decl_file   : 18
    <8d6>   DW_AT_decl_line   : 69
    <8d7>   DW_AT_decl_column : 14
    <8d8>   DW_AT_type        : <0xb8>
    <8dc>   DW_AT_data_member_location: 0
 <2><8dd>: Abbrev Number: 33 (DW_TAG_member)
    <8de>   DW_AT_name        : rem
    <8e2>   DW_AT_decl_file   : 18
    <8e2>   DW_AT_decl_line   : 70
    <8e3>   DW_AT_decl_column : 14
    <8e4>   DW_AT_type        : <0xb8>
    <8e8>   DW_AT_data_member_location: 8
 <2><8e9>: Abbrev Number: 0
 <1><8ea>: Abbrev Number: 5 (DW_TAG_typedef)
    <8eb>   DW_AT_name        : (indirect string, offset: 0xd0c): ldiv_t
    <8ef>   DW_AT_decl_file   : 18
    <8f0>   DW_AT_decl_line   : 71
    <8f1>   DW_AT_decl_column : 5
    <8f2>   DW_AT_type        : <0x8c3>
 <1><8f6>: Abbrev Number: 28 (DW_TAG_structure_type)
    <8f7>   DW_AT_byte_size   : 16
    <8f8>   DW_AT_decl_file   : 18
    <8f9>   DW_AT_decl_line   : 78
    <8fa>   DW_AT_decl_column : 3
    <8fb>   DW_AT_linkage_name: (indirect string, offset: 0x63b): 7lldiv_t
    <8ff>   DW_AT_sibling     : <0x91d>
 <2><903>: Abbrev Number: 4 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0x841): quot
    <908>   DW_AT_decl_file   : 18
    <909>   DW_AT_decl_line   : 79
    <90a>   DW_AT_decl_column : 19
    <90b>   DW_AT_type        : <0x5e8>
    <90f>   DW_AT_data_member_location: 0
 <2><910>: Abbrev Number: 33 (DW_TAG_member)
    <911>   DW_AT_name        : rem
    <915>   DW_AT_decl_file   : 18
    <915>   DW_AT_decl_line   : 80
    <916>   DW_AT_decl_column : 19
    <917>   DW_AT_type        : <0x5e8>
    <91b>   DW_AT_data_member_location: 8
 <2><91c>: Abbrev Number: 0
 <1><91d>: Abbrev Number: 5 (DW_TAG_typedef)
    <91e>   DW_AT_name        : (indirect string, offset: 0x63c): lldiv_t
    <922>   DW_AT_decl_file   : 18
    <923>   DW_AT_decl_line   : 81
    <924>   DW_AT_decl_column : 5
    <925>   DW_AT_type        : <0x8f6>
 <1><929>: Abbrev Number: 5 (DW_TAG_typedef)
    <92a>   DW_AT_name        : (indirect string, offset: 0x3ec): time_t
    <92e>   DW_AT_decl_file   : 19
    <92f>   DW_AT_decl_line   : 10
    <930>   DW_AT_decl_column : 18
    <931>   DW_AT_type        : <0x15b>
 <1><935>: Abbrev Number: 10 (DW_TAG_base_type)
    <936>   DW_AT_byte_size   : 8
    <937>   DW_AT_encoding    : 7	(unsigned)
    <938>   DW_AT_name        : (indirect string, offset: 0x545): long long unsigned int
 <1><93c>: Abbrev Number: 26 (DW_TAG_typedef)
    <93d>   DW_AT_name        : (indirect string, offset: 0x1010): __compar_fn_t
    <941>   DW_AT_decl_file   : 18
    <942>   DW_AT_decl_line   : 816
    <944>   DW_AT_decl_column : 15
    <945>   DW_AT_type        : <0x949>
 <1><949>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <94a>   DW_AT_byte_size   : 8
    <94a>   DW_AT_type        : <0x94e>
 <1><94e>: Abbrev Number: 61 (DW_TAG_subroutine_type)
    <94f>   DW_AT_type        : <0x99>
    <953>   DW_AT_sibling     : <0x962>
 <2><957>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <958>   DW_AT_type        : <0x962>
 <2><95c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <95d>   DW_AT_type        : <0x962>
 <2><961>: Abbrev Number: 0
 <1><962>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <963>   DW_AT_byte_size   : 8
    <963>   DW_AT_type        : <0x967>
 <1><967>: Abbrev Number: 62 (DW_TAG_const_type)
 <1><968>: Abbrev Number: 63 (DW_TAG_namespace)
    <969>   DW_AT_name        : std
    <96d>   DW_AT_decl_file   : 25
    <96e>   DW_AT_decl_line   : 278
    <970>   DW_AT_decl_column : 11
    <971>   DW_AT_sibling     : <0x125c>
 <2><975>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <976>   DW_AT_decl_file   : 20
    <977>   DW_AT_decl_line   : 127
    <978>   DW_AT_decl_column : 11
    <979>   DW_AT_import      : <0x8b7>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><97d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <97e>   DW_AT_decl_file   : 20
    <97f>   DW_AT_decl_line   : 128
    <980>   DW_AT_decl_column : 11
    <981>   DW_AT_import      : <0x8ea>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><985>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <986>   DW_AT_decl_file   : 20
    <987>   DW_AT_decl_line   : 134
    <988>   DW_AT_decl_column : 11
    <989>   DW_AT_import      : <0x125c>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><98d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <98e>   DW_AT_decl_file   : 20
    <98f>   DW_AT_decl_line   : 137
    <990>   DW_AT_decl_column : 11
    <991>   DW_AT_import      : <0x1279>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><995>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <996>   DW_AT_decl_file   : 20
    <997>   DW_AT_decl_line   : 140
    <998>   DW_AT_decl_column : 11
    <999>   DW_AT_import      : <0x1294>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><99d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <99e>   DW_AT_decl_file   : 20
    <99f>   DW_AT_decl_line   : 141
    <9a0>   DW_AT_decl_column : 11
    <9a1>   DW_AT_import      : <0x12aa>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><9a5>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9a6>   DW_AT_decl_file   : 20
    <9a7>   DW_AT_decl_line   : 142
    <9a8>   DW_AT_decl_column : 11
    <9a9>   DW_AT_import      : <0x12c0>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><9ad>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9ae>   DW_AT_decl_file   : 20
    <9af>   DW_AT_decl_line   : 143
    <9b0>   DW_AT_decl_column : 11
    <9b1>   DW_AT_import      : <0x12d6>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><9b5>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9b6>   DW_AT_decl_file   : 20
    <9b7>   DW_AT_decl_line   : 145
    <9b8>   DW_AT_decl_column : 11
    <9b9>   DW_AT_import      : <0x1301>	[Abbrev Number: 79 (DW_TAG_subprogram)]
 <2><9bd>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9be>   DW_AT_decl_file   : 20
    <9bf>   DW_AT_decl_line   : 148
    <9c0>   DW_AT_decl_column : 11
    <9c1>   DW_AT_import      : <0x131d>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><9c5>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9c6>   DW_AT_decl_file   : 20
    <9c7>   DW_AT_decl_line   : 150
    <9c8>   DW_AT_decl_column : 11
    <9c9>   DW_AT_import      : <0x1334>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><9cd>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9ce>   DW_AT_decl_file   : 20
    <9cf>   DW_AT_decl_line   : 153
    <9d0>   DW_AT_decl_column : 11
    <9d1>   DW_AT_import      : <0x1350>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><9d5>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9d6>   DW_AT_decl_file   : 20
    <9d7>   DW_AT_decl_line   : 154
    <9d8>   DW_AT_decl_column : 11
    <9d9>   DW_AT_import      : <0x136c>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><9dd>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9de>   DW_AT_decl_file   : 20
    <9df>   DW_AT_decl_line   : 155
    <9e0>   DW_AT_decl_column : 11
    <9e1>   DW_AT_import      : <0x1392>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><9e5>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9e6>   DW_AT_decl_file   : 20
    <9e7>   DW_AT_decl_line   : 157
    <9e8>   DW_AT_decl_column : 11
    <9e9>   DW_AT_import      : <0x13b3>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><9ed>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9ee>   DW_AT_decl_file   : 20
    <9ef>   DW_AT_decl_line   : 160
    <9f0>   DW_AT_decl_column : 11
    <9f1>   DW_AT_import      : <0x13d5>	[Abbrev Number: 47 (DW_TAG_subprogram)]
 <2><9f5>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9f6>   DW_AT_decl_file   : 20
    <9f7>   DW_AT_decl_line   : 163
    <9f8>   DW_AT_decl_column : 11
    <9f9>   DW_AT_import      : <0x13e6>	[Abbrev Number: 17 (DW_TAG_subprogram)]
 <2><9fd>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <9fe>   DW_AT_decl_file   : 20
    <9ff>   DW_AT_decl_line   : 165
    <a00>   DW_AT_decl_column : 11
    <a01>   DW_AT_import      : <0x13f3>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><a05>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a06>   DW_AT_decl_file   : 20
    <a07>   DW_AT_decl_line   : 166
    <a08>   DW_AT_decl_column : 11
    <a09>   DW_AT_import      : <0x1406>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><a0d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a0e>   DW_AT_decl_file   : 20
    <a0f>   DW_AT_decl_line   : 167
    <a10>   DW_AT_decl_column : 11
    <a11>   DW_AT_import      : <0x1426>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><a15>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a16>   DW_AT_decl_file   : 20
    <a17>   DW_AT_decl_line   : 168
    <a18>   DW_AT_decl_column : 11
    <a19>   DW_AT_import      : <0x1446>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><a1d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a1e>   DW_AT_decl_file   : 20
    <a1f>   DW_AT_decl_line   : 169
    <a20>   DW_AT_decl_column : 11
    <a21>   DW_AT_import      : <0x1466>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><a25>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a26>   DW_AT_decl_file   : 20
    <a27>   DW_AT_decl_line   : 171
    <a28>   DW_AT_decl_column : 11
    <a29>   DW_AT_import      : <0x147d>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><a2d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a2e>   DW_AT_decl_file   : 20
    <a2f>   DW_AT_decl_line   : 172
    <a30>   DW_AT_decl_column : 11
    <a31>   DW_AT_import      : <0x14a3>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><a35>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a36>   DW_AT_decl_file   : 20
    <a37>   DW_AT_decl_line   : 240
    <a38>   DW_AT_decl_column : 22
    <a39>   DW_AT_import      : <0x91d>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><a3d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a3e>   DW_AT_decl_file   : 20
    <a3f>   DW_AT_decl_line   : 245
    <a40>   DW_AT_decl_column : 22
    <a41>   DW_AT_import      : <0x1504>	[Abbrev Number: 16 (DW_TAG_subprogram)]
 <2><a45>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a46>   DW_AT_decl_file   : 20
    <a47>   DW_AT_decl_line   : 246
    <a48>   DW_AT_decl_column : 22
    <a49>   DW_AT_import      : <0x1543>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><a4d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a4e>   DW_AT_decl_file   : 20
    <a4f>   DW_AT_decl_line   : 248
    <a50>   DW_AT_decl_column : 22
    <a51>   DW_AT_import      : <0x155f>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><a55>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a56>   DW_AT_decl_file   : 20
    <a57>   DW_AT_decl_line   : 249
    <a58>   DW_AT_decl_column : 22
    <a59>   DW_AT_import      : <0x15b5>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><a5d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a5e>   DW_AT_decl_file   : 20
    <a5f>   DW_AT_decl_line   : 250
    <a60>   DW_AT_decl_column : 22
    <a61>   DW_AT_import      : <0x1575>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><a65>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a66>   DW_AT_decl_file   : 20
    <a67>   DW_AT_decl_line   : 251
    <a68>   DW_AT_decl_column : 22
    <a69>   DW_AT_import      : <0x1595>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><a6d>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <a6e>   DW_AT_decl_file   : 20
    <a6f>   DW_AT_decl_line   : 252
    <a70>   DW_AT_decl_column : 22
    <a71>   DW_AT_import      : <0x15d0>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><a75>: Abbrev Number: 16 (DW_TAG_subprogram)
    <a76>   DW_AT_external    : 1
    <a76>   DW_AT_name        : abs
    <a7a>   DW_AT_decl_file   : 21
    <a7b>   DW_AT_decl_line   : 103
    <a7c>   DW_AT_decl_column : 3
    <a7c>   DW_AT_linkage_name: (indirect string, offset: 0x411): _ZSt3absg
    <a80>   DW_AT_type        : <0x5cc>
    <a84>   DW_AT_declaration : 1
    <a84>   DW_AT_sibling     : <0xa8e>
 <3><a88>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a89>   DW_AT_type        : <0x5cc>
 <3><a8d>: Abbrev Number: 0
 <2><a8e>: Abbrev Number: 16 (DW_TAG_subprogram)
    <a8f>   DW_AT_external    : 1
    <a8f>   DW_AT_name        : abs
    <a93>   DW_AT_decl_file   : 21
    <a94>   DW_AT_decl_line   : 85
    <a95>   DW_AT_decl_column : 3
    <a95>   DW_AT_linkage_name: (indirect string, offset: 0x431): _ZSt3absn
    <a99>   DW_AT_type        : <0x161b>
    <a9d>   DW_AT_declaration : 1
    <a9d>   DW_AT_sibling     : <0xaa7>
 <3><aa1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aa2>   DW_AT_type        : <0x161b>
 <3><aa6>: Abbrev Number: 0
 <2><aa7>: Abbrev Number: 16 (DW_TAG_subprogram)
    <aa8>   DW_AT_external    : 1
    <aa8>   DW_AT_name        : abs
    <aac>   DW_AT_decl_file   : 21
    <aad>   DW_AT_decl_line   : 79
    <aae>   DW_AT_decl_column : 3
    <aae>   DW_AT_linkage_name: (indirect string, offset: 0x3fd): _ZSt3abse
    <ab2>   DW_AT_type        : <0x5e1>
    <ab6>   DW_AT_declaration : 1
    <ab6>   DW_AT_sibling     : <0xac0>
 <3><aba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <abb>   DW_AT_type        : <0x5e1>
 <3><abf>: Abbrev Number: 0
 <2><ac0>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ac1>   DW_AT_external    : 1
    <ac1>   DW_AT_name        : abs
    <ac5>   DW_AT_decl_file   : 21
    <ac6>   DW_AT_decl_line   : 75
    <ac7>   DW_AT_decl_column : 3
    <ac7>   DW_AT_linkage_name: (indirect string, offset: 0x407): _ZSt3absf
    <acb>   DW_AT_type        : <0x5d3>
    <acf>   DW_AT_declaration : 1
    <acf>   DW_AT_sibling     : <0xad9>
 <3><ad3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ad4>   DW_AT_type        : <0x5d3>
 <3><ad8>: Abbrev Number: 0
 <2><ad9>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ada>   DW_AT_external    : 1
    <ada>   DW_AT_name        : abs
    <ade>   DW_AT_decl_file   : 21
    <adf>   DW_AT_decl_line   : 71
    <ae0>   DW_AT_decl_column : 3
    <ae0>   DW_AT_linkage_name: (indirect string, offset: 0x3f3): _ZSt3absd
    <ae4>   DW_AT_type        : <0x5da>
    <ae8>   DW_AT_declaration : 1
    <ae8>   DW_AT_sibling     : <0xaf2>
 <3><aec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed>   DW_AT_type        : <0x5da>
 <3><af1>: Abbrev Number: 0
 <2><af2>: Abbrev Number: 16 (DW_TAG_subprogram)
    <af3>   DW_AT_external    : 1
    <af3>   DW_AT_name        : abs
    <af7>   DW_AT_decl_file   : 21
    <af8>   DW_AT_decl_line   : 61
    <af9>   DW_AT_decl_column : 3
    <af9>   DW_AT_linkage_name: (indirect string, offset: 0xf2e): _ZSt3absx
    <afd>   DW_AT_type        : <0x5e8>
    <b01>   DW_AT_declaration : 1
    <b01>   DW_AT_sibling     : <0xb0b>
 <3><b05>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b06>   DW_AT_type        : <0x5e8>
 <3><b0a>: Abbrev Number: 0
 <2><b0b>: Abbrev Number: 16 (DW_TAG_subprogram)
    <b0c>   DW_AT_external    : 1
    <b0c>   DW_AT_name        : abs
    <b10>   DW_AT_decl_file   : 21
    <b11>   DW_AT_decl_line   : 56
    <b12>   DW_AT_decl_column : 3
    <b12>   DW_AT_linkage_name: (indirect string, offset: 0x41b): _ZSt3absl
    <b16>   DW_AT_type        : <0xb8>
    <b1a>   DW_AT_declaration : 1
    <b1a>   DW_AT_sibling     : <0xb24>
 <3><b1e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1f>   DW_AT_type        : <0xb8>
 <3><b23>: Abbrev Number: 0
 <2><b24>: Abbrev Number: 16 (DW_TAG_subprogram)
    <b25>   DW_AT_external    : 1
    <b25>   DW_AT_name        : div
    <b29>   DW_AT_decl_file   : 20
    <b2a>   DW_AT_decl_line   : 177
    <b2b>   DW_AT_decl_column : 3
    <b2b>   DW_AT_linkage_name: (indirect string, offset: 0x1e0): _ZSt3divll
    <b2f>   DW_AT_type        : <0x8ea>
    <b33>   DW_AT_declaration : 1
    <b33>   DW_AT_sibling     : <0xb42>
 <3><b37>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b38>   DW_AT_type        : <0xb8>
 <3><b3c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b3d>   DW_AT_type        : <0xb8>
 <3><b41>: Abbrev Number: 0
 <2><b42>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b43>   DW_AT_decl_file   : 22
    <b44>   DW_AT_decl_line   : 64
    <b45>   DW_AT_decl_column : 11
    <b46>   DW_AT_import      : <0x7fd>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><b4a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b4b>   DW_AT_decl_file   : 22
    <b4c>   DW_AT_decl_line   : 141
    <b4d>   DW_AT_decl_column : 11
    <b4e>   DW_AT_import      : <0x7f1>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><b52>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b53>   DW_AT_decl_file   : 22
    <b54>   DW_AT_decl_line   : 143
    <b55>   DW_AT_decl_column : 11
    <b56>   DW_AT_import      : <0x179b>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><b5a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b5b>   DW_AT_decl_file   : 22
    <b5c>   DW_AT_decl_line   : 144
    <b5d>   DW_AT_decl_column : 11
    <b5e>   DW_AT_import      : <0x17b2>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><b62>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b63>   DW_AT_decl_file   : 22
    <b64>   DW_AT_decl_line   : 145
    <b65>   DW_AT_decl_column : 11
    <b66>   DW_AT_import      : <0x17ce>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><b6a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b6b>   DW_AT_decl_file   : 22
    <b6c>   DW_AT_decl_line   : 146
    <b6d>   DW_AT_decl_column : 11
    <b6e>   DW_AT_import      : <0x17ef>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><b72>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b73>   DW_AT_decl_file   : 22
    <b74>   DW_AT_decl_line   : 147
    <b75>   DW_AT_decl_column : 11
    <b76>   DW_AT_import      : <0x180b>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><b7a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b7b>   DW_AT_decl_file   : 22
    <b7c>   DW_AT_decl_line   : 148
    <b7d>   DW_AT_decl_column : 11
    <b7e>   DW_AT_import      : <0x1827>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><b82>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b83>   DW_AT_decl_file   : 22
    <b84>   DW_AT_decl_line   : 149
    <b85>   DW_AT_decl_column : 11
    <b86>   DW_AT_import      : <0x1843>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><b8a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b8b>   DW_AT_decl_file   : 22
    <b8c>   DW_AT_decl_line   : 150
    <b8d>   DW_AT_decl_column : 11
    <b8e>   DW_AT_import      : <0x1860>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><b92>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b93>   DW_AT_decl_file   : 22
    <b94>   DW_AT_decl_line   : 151
    <b95>   DW_AT_decl_column : 11
    <b96>   DW_AT_import      : <0x1881>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><b9a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <b9b>   DW_AT_decl_file   : 22
    <b9c>   DW_AT_decl_line   : 152
    <b9d>   DW_AT_decl_column : 11
    <b9e>   DW_AT_import      : <0x1898>	[Abbrev Number: 17 (DW_TAG_subprogram)]
 <2><ba2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <ba3>   DW_AT_decl_file   : 22
    <ba4>   DW_AT_decl_line   : 153
    <ba5>   DW_AT_decl_column : 11
    <ba6>   DW_AT_import      : <0x18a5>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><baa>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <bab>   DW_AT_decl_file   : 22
    <bac>   DW_AT_decl_line   : 154
    <bad>   DW_AT_decl_column : 11
    <bae>   DW_AT_import      : <0x18cb>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><bb2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <bb3>   DW_AT_decl_file   : 22
    <bb4>   DW_AT_decl_line   : 155
    <bb5>   DW_AT_decl_column : 11
    <bb6>   DW_AT_import      : <0x18f1>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><bba>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <bbb>   DW_AT_decl_file   : 22
    <bbc>   DW_AT_decl_line   : 156
    <bbd>   DW_AT_decl_column : 11
    <bbe>   DW_AT_import      : <0x190d>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><bc2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <bc3>   DW_AT_decl_file   : 22
    <bc4>   DW_AT_decl_line   : 157
    <bc5>   DW_AT_decl_column : 11
    <bc6>   DW_AT_import      : <0x1938>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><bca>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <bcb>   DW_AT_decl_file   : 22
    <bcc>   DW_AT_decl_line   : 158
    <bcd>   DW_AT_decl_column : 11
    <bce>   DW_AT_import      : <0x1954>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><bd2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <bd3>   DW_AT_decl_file   : 22
    <bd4>   DW_AT_decl_line   : 160
    <bd5>   DW_AT_decl_column : 11
    <bd6>   DW_AT_import      : <0x196b>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><bda>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <bdb>   DW_AT_decl_file   : 22
    <bdc>   DW_AT_decl_line   : 162
    <bdd>   DW_AT_decl_column : 11
    <bde>   DW_AT_import      : <0x198d>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><be2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <be3>   DW_AT_decl_file   : 22
    <be4>   DW_AT_decl_line   : 163
    <be5>   DW_AT_decl_column : 11
    <be6>   DW_AT_import      : <0x19ae>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><bea>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <beb>   DW_AT_decl_file   : 22
    <bec>   DW_AT_decl_line   : 164
    <bed>   DW_AT_decl_column : 11
    <bee>   DW_AT_import      : <0x19ca>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><bf2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <bf3>   DW_AT_decl_file   : 22
    <bf4>   DW_AT_decl_line   : 166
    <bf5>   DW_AT_decl_column : 11
    <bf6>   DW_AT_import      : <0x19f0>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><bfa>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <bfb>   DW_AT_decl_file   : 22
    <bfc>   DW_AT_decl_line   : 169
    <bfd>   DW_AT_decl_column : 11
    <bfe>   DW_AT_import      : <0x1a15>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><c02>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c03>   DW_AT_decl_file   : 22
    <c04>   DW_AT_decl_line   : 172
    <c05>   DW_AT_decl_column : 11
    <c06>   DW_AT_import      : <0x1a3b>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><c0a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c0b>   DW_AT_decl_file   : 22
    <c0c>   DW_AT_decl_line   : 174
    <c0d>   DW_AT_decl_column : 11
    <c0e>   DW_AT_import      : <0x1a60>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><c12>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c13>   DW_AT_decl_file   : 22
    <c14>   DW_AT_decl_line   : 176
    <c15>   DW_AT_decl_column : 11
    <c16>   DW_AT_import      : <0x1a7c>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><c1a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c1b>   DW_AT_decl_file   : 22
    <c1c>   DW_AT_decl_line   : 178
    <c1d>   DW_AT_decl_column : 11
    <c1e>   DW_AT_import      : <0x1a9c>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><c22>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c23>   DW_AT_decl_file   : 22
    <c24>   DW_AT_decl_line   : 179
    <c25>   DW_AT_decl_column : 11
    <c26>   DW_AT_import      : <0x1abd>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c2a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c2b>   DW_AT_decl_file   : 22
    <c2c>   DW_AT_decl_line   : 180
    <c2d>   DW_AT_decl_column : 11
    <c2e>   DW_AT_import      : <0x1ad8>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c32>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c33>   DW_AT_decl_file   : 22
    <c34>   DW_AT_decl_line   : 181
    <c35>   DW_AT_decl_column : 11
    <c36>   DW_AT_import      : <0x1af3>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c3a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c3b>   DW_AT_decl_file   : 22
    <c3c>   DW_AT_decl_line   : 182
    <c3d>   DW_AT_decl_column : 11
    <c3e>   DW_AT_import      : <0x1b0e>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c42>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c43>   DW_AT_decl_file   : 22
    <c44>   DW_AT_decl_line   : 183
    <c45>   DW_AT_decl_column : 11
    <c46>   DW_AT_import      : <0x1b29>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c4a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c4b>   DW_AT_decl_file   : 22
    <c4c>   DW_AT_decl_line   : 184
    <c4d>   DW_AT_decl_column : 11
    <c4e>   DW_AT_import      : <0x1b44>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><c52>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c53>   DW_AT_decl_file   : 22
    <c54>   DW_AT_decl_line   : 185
    <c55>   DW_AT_decl_column : 11
    <c56>   DW_AT_import      : <0x1b6f>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c5a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c5b>   DW_AT_decl_file   : 22
    <c5c>   DW_AT_decl_line   : 186
    <c5d>   DW_AT_decl_column : 11
    <c5e>   DW_AT_import      : <0x1b85>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c62>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c63>   DW_AT_decl_file   : 22
    <c64>   DW_AT_decl_line   : 187
    <c65>   DW_AT_decl_column : 11
    <c66>   DW_AT_import      : <0x1ba5>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c6a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c6b>   DW_AT_decl_file   : 22
    <c6c>   DW_AT_decl_line   : 188
    <c6d>   DW_AT_decl_column : 11
    <c6e>   DW_AT_import      : <0x1bc5>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c72>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c73>   DW_AT_decl_file   : 22
    <c74>   DW_AT_decl_line   : 189
    <c75>   DW_AT_decl_column : 11
    <c76>   DW_AT_import      : <0x1be5>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><c7a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c7b>   DW_AT_decl_file   : 22
    <c7c>   DW_AT_decl_line   : 190
    <c7d>   DW_AT_decl_column : 11
    <c7e>   DW_AT_import      : <0x1c10>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c82>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c83>   DW_AT_decl_file   : 22
    <c84>   DW_AT_decl_line   : 191
    <c85>   DW_AT_decl_column : 11
    <c86>   DW_AT_import      : <0x1c2b>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><c8a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c8b>   DW_AT_decl_file   : 22
    <c8c>   DW_AT_decl_line   : 193
    <c8d>   DW_AT_decl_column : 11
    <c8e>   DW_AT_import      : <0x1c4c>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><c92>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c93>   DW_AT_decl_file   : 22
    <c94>   DW_AT_decl_line   : 195
    <c95>   DW_AT_decl_column : 11
    <c96>   DW_AT_import      : <0x1c68>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><c9a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <c9b>   DW_AT_decl_file   : 22
    <c9c>   DW_AT_decl_line   : 196
    <c9d>   DW_AT_decl_column : 11
    <c9e>   DW_AT_import      : <0x1c88>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><ca2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <ca3>   DW_AT_decl_file   : 22
    <ca4>   DW_AT_decl_line   : 197
    <ca5>   DW_AT_decl_column : 11
    <ca6>   DW_AT_import      : <0x1ca9>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><caa>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <cab>   DW_AT_decl_file   : 22
    <cac>   DW_AT_decl_line   : 198
    <cad>   DW_AT_decl_column : 11
    <cae>   DW_AT_import      : <0x1cca>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><cb2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <cb3>   DW_AT_decl_file   : 22
    <cb4>   DW_AT_decl_line   : 199
    <cb5>   DW_AT_decl_column : 11
    <cb6>   DW_AT_import      : <0x1cea>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><cba>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <cbb>   DW_AT_decl_file   : 22
    <cbc>   DW_AT_decl_line   : 200
    <cbd>   DW_AT_decl_column : 11
    <cbe>   DW_AT_import      : <0x1d01>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><cc2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <cc3>   DW_AT_decl_file   : 22
    <cc4>   DW_AT_decl_line   : 201
    <cc5>   DW_AT_decl_column : 11
    <cc6>   DW_AT_import      : <0x1d22>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><cca>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <ccb>   DW_AT_decl_file   : 22
    <ccc>   DW_AT_decl_line   : 202
    <ccd>   DW_AT_decl_column : 11
    <cce>   DW_AT_import      : <0x1d43>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><cd2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <cd3>   DW_AT_decl_file   : 22
    <cd4>   DW_AT_decl_line   : 203
    <cd5>   DW_AT_decl_column : 11
    <cd6>   DW_AT_import      : <0x1d64>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><cda>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <cdb>   DW_AT_decl_file   : 22
    <cdc>   DW_AT_decl_line   : 204
    <cdd>   DW_AT_decl_column : 11
    <cde>   DW_AT_import      : <0x1d85>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><ce2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <ce3>   DW_AT_decl_file   : 22
    <ce4>   DW_AT_decl_line   : 205
    <ce5>   DW_AT_decl_column : 11
    <ce6>   DW_AT_import      : <0x1d9d>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><cea>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <ceb>   DW_AT_decl_file   : 22
    <cec>   DW_AT_decl_line   : 206
    <ced>   DW_AT_decl_column : 11
    <cee>   DW_AT_import      : <0x1db9>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><cf2>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <cf3>   DW_AT_decl_file   : 22
    <cf4>   DW_AT_decl_line   : 206
    <cf5>   DW_AT_decl_column : 11
    <cf6>   DW_AT_import      : <0x1dd7>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><cfa>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <cfb>   DW_AT_decl_file   : 22
    <cfc>   DW_AT_decl_line   : 207
    <cfd>   DW_AT_decl_column : 11
    <cfe>   DW_AT_import      : <0x1df5>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><d02>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <d03>   DW_AT_decl_file   : 22
    <d04>   DW_AT_decl_line   : 207
    <d05>   DW_AT_decl_column : 11
    <d06>   DW_AT_import      : <0x1e13>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><d0a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <d0b>   DW_AT_decl_file   : 22
    <d0c>   DW_AT_decl_line   : 208
    <d0d>   DW_AT_decl_column : 11
    <d0e>   DW_AT_import      : <0x1e31>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><d12>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <d13>   DW_AT_decl_file   : 22
    <d14>   DW_AT_decl_line   : 208
    <d15>   DW_AT_decl_column : 11
    <d16>   DW_AT_import      : <0x1e4f>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><d1a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <d1b>   DW_AT_decl_file   : 22
    <d1c>   DW_AT_decl_line   : 209
    <d1d>   DW_AT_decl_column : 11
    <d1e>   DW_AT_import      : <0x1e6d>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><d22>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <d23>   DW_AT_decl_file   : 22
    <d24>   DW_AT_decl_line   : 209
    <d25>   DW_AT_decl_column : 11
    <d26>   DW_AT_import      : <0x1e8b>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><d2a>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <d2b>   DW_AT_decl_file   : 22
    <d2c>   DW_AT_decl_line   : 210
    <d2d>   DW_AT_decl_column : 11
    <d2e>   DW_AT_import      : <0x1ea9>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><d32>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <d33>   DW_AT_decl_file   : 22
    <d34>   DW_AT_decl_line   : 210
    <d35>   DW_AT_decl_column : 11
    <d36>   DW_AT_import      : <0x1ecc>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><d3a>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d3b>   DW_AT_decl_file   : 22
    <d3b>   DW_AT_decl_line   : 267
    <d3d>   DW_AT_decl_column : 22
    <d3e>   DW_AT_import      : <0x1eef>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><d42>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d43>   DW_AT_decl_file   : 22
    <d43>   DW_AT_decl_line   : 268
    <d45>   DW_AT_decl_column : 22
    <d46>   DW_AT_import      : <0x1f0b>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><d4a>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d4b>   DW_AT_decl_file   : 22
    <d4b>   DW_AT_decl_line   : 269
    <d4d>   DW_AT_decl_column : 22
    <d4e>   DW_AT_import      : <0x1f2c>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><d52>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d53>   DW_AT_decl_file   : 22
    <d53>   DW_AT_decl_line   : 283
    <d55>   DW_AT_decl_column : 14
    <d56>   DW_AT_import      : <0x1c4c>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><d5a>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d5b>   DW_AT_decl_file   : 22
    <d5b>   DW_AT_decl_line   : 286
    <d5d>   DW_AT_decl_column : 14
    <d5e>   DW_AT_import      : <0x19f0>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><d62>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d63>   DW_AT_decl_file   : 22
    <d63>   DW_AT_decl_line   : 289
    <d65>   DW_AT_decl_column : 14
    <d66>   DW_AT_import      : <0x1a3b>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><d6a>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d6b>   DW_AT_decl_file   : 22
    <d6b>   DW_AT_decl_line   : 292
    <d6d>   DW_AT_decl_column : 14
    <d6e>   DW_AT_import      : <0x1a7c>	[Abbrev Number: 18 (DW_TAG_subprogram)]
 <2><d72>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d73>   DW_AT_decl_file   : 22
    <d73>   DW_AT_decl_line   : 296
    <d75>   DW_AT_decl_column : 14
    <d76>   DW_AT_import      : <0x1eef>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><d7a>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d7b>   DW_AT_decl_file   : 22
    <d7b>   DW_AT_decl_line   : 297
    <d7d>   DW_AT_decl_column : 14
    <d7e>   DW_AT_import      : <0x1f0b>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><d82>: Abbrev Number: 13 (DW_TAG_imported_declaration)
    <d83>   DW_AT_decl_file   : 22
    <d83>   DW_AT_decl_line   : 298
    <d85>   DW_AT_decl_column : 14
    <d86>   DW_AT_import      : <0x1f2c>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><d8a>: Abbrev Number: 41 (DW_TAG_namespace)
    <d8b>   DW_AT_name        : (indirect string, offset: 0xd8f): __swappable_details
    <d8f>   DW_AT_decl_file   : 23
    <d8f>   DW_AT_decl_line   : 2694
    <d91>   DW_AT_decl_column : 13
 <2><d91>: Abbrev Number: 41 (DW_TAG_namespace)
    <d92>   DW_AT_name        : (indirect string, offset: 0x525): __swappable_with_details
    <d96>   DW_AT_decl_file   : 23
    <d96>   DW_AT_decl_line   : 2780
    <d98>   DW_AT_decl_column : 13
 <2><d98>: Abbrev Number: 42 (DW_TAG_namespace)
    <d99>   DW_AT_name        : (indirect string, offset: 0x27e): __exception_ptr
    <d9d>   DW_AT_decl_file   : 24
    <d9e>   DW_AT_decl_line   : 63
    <d9f>   DW_AT_decl_column : 13
    <da0>   DW_AT_sibling     : <0xf5f>
 <3><da4>: Abbrev Number: 64 (DW_TAG_class_type)
    <da5>   DW_AT_name        : (indirect string, offset: 0x280): exception_ptr
    <da9>   DW_AT_byte_size   : 8
    <daa>   DW_AT_decl_file   : 24
    <dab>   DW_AT_decl_line   : 90
    <dac>   DW_AT_decl_column : 11
    <dad>   DW_AT_sibling     : <0xf51>
 <4><db1>: Abbrev Number: 4 (DW_TAG_member)
    <db2>   DW_AT_name        : (indirect string, offset: 0x5f9): _M_exception_object
    <db6>   DW_AT_decl_file   : 24
    <db7>   DW_AT_decl_line   : 92
    <db8>   DW_AT_decl_column : 13
    <db9>   DW_AT_type        : <0x173>
    <dbd>   DW_AT_data_member_location: 0
 <4><dbe>: Abbrev Number: 65 (DW_TAG_subprogram)
    <dbf>   DW_AT_external    : 1
    <dbf>   DW_AT_name        : (indirect string, offset: 0x280): exception_ptr
    <dc3>   DW_AT_decl_file   : 24
    <dc4>   DW_AT_decl_line   : 94
    <dc5>   DW_AT_decl_column : 16
    <dc6>   DW_AT_linkage_name: (indirect string, offset: 0x35): _ZNSt15__exception_ptr13exception_ptrC4EPv
    <dca>   DW_AT_declaration : 1
    <dca>   DW_AT_explicit    : 1
    <dca>   DW_AT_object_pointer: <0xdd2>
    <dce>   DW_AT_sibling     : <0xddd>
 <5><dd2>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <dd3>   DW_AT_type        : <0x1f62>
    <dd7>   DW_AT_artificial  : 1
 <5><dd7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd8>   DW_AT_type        : <0x173>
 <5><ddc>: Abbrev Number: 0
 <4><ddd>: Abbrev Number: 43 (DW_TAG_subprogram)
    <dde>   DW_AT_external    : 1
    <dde>   DW_AT_name        : (indirect string, offset: 0xd85): _M_addref
    <de2>   DW_AT_decl_file   : 24
    <de2>   DW_AT_decl_line   : 96
    <de3>   DW_AT_decl_column : 12
    <de3>   DW_AT_linkage_name: (indirect string, offset: 0x120a): _ZNSt15__exception_ptr13exception_ptr9_M_addrefEv
    <de7>   DW_AT_declaration : 1
    <de7>   DW_AT_object_pointer: <0xdef>
    <deb>   DW_AT_sibling     : <0xdf5>
 <5><def>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <df0>   DW_AT_type        : <0x1f62>
    <df4>   DW_AT_artificial  : 1
 <5><df4>: Abbrev Number: 0
 <4><df5>: Abbrev Number: 43 (DW_TAG_subprogram)
    <df6>   DW_AT_external    : 1
    <df6>   DW_AT_name        : (indirect string, offset: 0xfb1): _M_release
    <dfa>   DW_AT_decl_file   : 24
    <dfa>   DW_AT_decl_line   : 97
    <dfb>   DW_AT_decl_column : 12
    <dfb>   DW_AT_linkage_name: (indirect string, offset: 0x97): _ZNSt15__exception_ptr13exception_ptr10_M_releaseEv
    <dff>   DW_AT_declaration : 1
    <dff>   DW_AT_object_pointer: <0xe07>
    <e03>   DW_AT_sibling     : <0xe0d>
 <5><e07>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e08>   DW_AT_type        : <0x1f62>
    <e0c>   DW_AT_artificial  : 1
 <5><e0c>: Abbrev Number: 0
 <4><e0d>: Abbrev Number: 66 (DW_TAG_subprogram)
    <e0e>   DW_AT_external    : 1
    <e0e>   DW_AT_name        : (indirect string, offset: 0x9ba): _M_get
    <e12>   DW_AT_decl_file   : 24
    <e13>   DW_AT_decl_line   : 99
    <e14>   DW_AT_decl_column : 13
    <e15>   DW_AT_linkage_name: (indirect string, offset: 0x1142): _ZNKSt15__exception_ptr13exception_ptr6_M_getEv
    <e19>   DW_AT_type        : <0x173>
    <e1d>   DW_AT_declaration : 1
    <e1d>   DW_AT_object_pointer: <0xe25>
    <e21>   DW_AT_sibling     : <0xe2b>
 <5><e25>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e26>   DW_AT_type        : <0x1f67>
    <e2a>   DW_AT_artificial  : 1
 <5><e2a>: Abbrev Number: 0
 <4><e2b>: Abbrev Number: 22 (DW_TAG_subprogram)
    <e2c>   DW_AT_external    : 1
    <e2c>   DW_AT_name        : (indirect string, offset: 0x280): exception_ptr
    <e30>   DW_AT_decl_file   : 24
    <e30>   DW_AT_decl_line   : 107
    <e31>   DW_AT_decl_column : 7
    <e31>   DW_AT_linkage_name: (indirect string, offset: 0x947): _ZNSt15__exception_ptr13exception_ptrC4Ev
    <e35>   DW_AT_accessibility: 1	(public)
    <e35>   DW_AT_declaration : 1
    <e35>   DW_AT_object_pointer: <0xe3d>
    <e39>   DW_AT_sibling     : <0xe43>
 <5><e3d>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e3e>   DW_AT_type        : <0x1f62>
    <e42>   DW_AT_artificial  : 1
 <5><e42>: Abbrev Number: 0
 <4><e43>: Abbrev Number: 22 (DW_TAG_subprogram)
    <e44>   DW_AT_external    : 1
    <e44>   DW_AT_name        : (indirect string, offset: 0x280): exception_ptr
    <e48>   DW_AT_decl_file   : 24
    <e48>   DW_AT_decl_line   : 109
    <e49>   DW_AT_decl_column : 7
    <e49>   DW_AT_linkage_name: (indirect string, offset: 0x106f): _ZNSt15__exception_ptr13exception_ptrC4ERKS0_
    <e4d>   DW_AT_accessibility: 1	(public)
    <e4d>   DW_AT_declaration : 1
    <e4d>   DW_AT_object_pointer: <0xe55>
    <e51>   DW_AT_sibling     : <0xe60>
 <5><e55>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e56>   DW_AT_type        : <0x1f62>
    <e5a>   DW_AT_artificial  : 1
 <5><e5a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e5b>   DW_AT_type        : <0x1f6c>
 <5><e5f>: Abbrev Number: 0
 <4><e60>: Abbrev Number: 22 (DW_TAG_subprogram)
    <e61>   DW_AT_external    : 1
    <e61>   DW_AT_name        : (indirect string, offset: 0x280): exception_ptr
    <e65>   DW_AT_decl_file   : 24
    <e65>   DW_AT_decl_line   : 112
    <e66>   DW_AT_decl_column : 7
    <e66>   DW_AT_linkage_name: (indirect string, offset: 0x4ab): _ZNSt15__exception_ptr13exception_ptrC4EDn
    <e6a>   DW_AT_accessibility: 1	(public)
    <e6a>   DW_AT_declaration : 1
    <e6a>   DW_AT_object_pointer: <0xe72>
    <e6e>   DW_AT_sibling     : <0xe7d>
 <5><e72>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e73>   DW_AT_type        : <0x1f62>
    <e77>   DW_AT_artificial  : 1
 <5><e77>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e78>   DW_AT_type        : <0xf7d>
 <5><e7c>: Abbrev Number: 0
 <4><e7d>: Abbrev Number: 22 (DW_TAG_subprogram)
    <e7e>   DW_AT_external    : 1
    <e7e>   DW_AT_name        : (indirect string, offset: 0x280): exception_ptr
    <e82>   DW_AT_decl_file   : 24
    <e82>   DW_AT_decl_line   : 116
    <e83>   DW_AT_decl_column : 7
    <e83>   DW_AT_linkage_name: (indirect string, offset: 0x56c): _ZNSt15__exception_ptr13exception_ptrC4EOS0_
    <e87>   DW_AT_accessibility: 1	(public)
    <e87>   DW_AT_declaration : 1
    <e87>   DW_AT_object_pointer: <0xe8f>
    <e8b>   DW_AT_sibling     : <0xe9a>
 <5><e8f>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e90>   DW_AT_type        : <0x1f62>
    <e94>   DW_AT_artificial  : 1
 <5><e94>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e95>   DW_AT_type        : <0x1f71>
 <5><e99>: Abbrev Number: 0
 <4><e9a>: Abbrev Number: 44 (DW_TAG_subprogram)
    <e9b>   DW_AT_external    : 1
    <e9b>   DW_AT_name        : (indirect string, offset: 0x9b0): operator=
    <e9f>   DW_AT_decl_file   : 24
    <e9f>   DW_AT_decl_line   : 129
    <ea0>   DW_AT_decl_column : 7
    <ea0>   DW_AT_linkage_name: (indirect string, offset: 0x1172): _ZNSt15__exception_ptr13exception_ptraSERKS0_
    <ea4>   DW_AT_type        : <0x1f77>
    <ea8>   DW_AT_accessibility: 1	(public)
    <ea8>   DW_AT_declaration : 1
    <ea8>   DW_AT_object_pointer: <0xeb0>
    <eac>   DW_AT_sibling     : <0xebb>
 <5><eb0>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <eb1>   DW_AT_type        : <0x1f62>
    <eb5>   DW_AT_artificial  : 1
 <5><eb5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eb6>   DW_AT_type        : <0x1f6c>
 <5><eba>: Abbrev Number: 0
 <4><ebb>: Abbrev Number: 44 (DW_TAG_subprogram)
    <ebc>   DW_AT_external    : 1
    <ebc>   DW_AT_name        : (indirect string, offset: 0x9b0): operator=
    <ec0>   DW_AT_decl_file   : 24
    <ec0>   DW_AT_decl_line   : 133
    <ec1>   DW_AT_decl_column : 7
    <ec1>   DW_AT_linkage_name: (indirect string, offset: 0xc36): _ZNSt15__exception_ptr13exception_ptraSEOS0_
    <ec5>   DW_AT_type        : <0x1f77>
    <ec9>   DW_AT_accessibility: 1	(public)
    <ec9>   DW_AT_declaration : 1
    <ec9>   DW_AT_object_pointer: <0xed1>
    <ecd>   DW_AT_sibling     : <0xedc>
 <5><ed1>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ed2>   DW_AT_type        : <0x1f62>
    <ed6>   DW_AT_artificial  : 1
 <5><ed6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ed7>   DW_AT_type        : <0x1f71>
 <5><edb>: Abbrev Number: 0
 <4><edc>: Abbrev Number: 22 (DW_TAG_subprogram)
    <edd>   DW_AT_external    : 1
    <edd>   DW_AT_name        : (indirect string, offset: 0x7f0): ~exception_ptr
    <ee1>   DW_AT_decl_file   : 24
    <ee1>   DW_AT_decl_line   : 140
    <ee2>   DW_AT_decl_column : 7
    <ee2>   DW_AT_linkage_name: (indirect string, offset: 0x817): _ZNSt15__exception_ptr13exception_ptrD4Ev
    <ee6>   DW_AT_accessibility: 1	(public)
    <ee6>   DW_AT_declaration : 1
    <ee6>   DW_AT_object_pointer: <0xeee>
    <eea>   DW_AT_sibling     : <0xef9>
 <5><eee>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <eef>   DW_AT_type        : <0x1f62>
    <ef3>   DW_AT_artificial  : 1
 <5><ef3>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ef4>   DW_AT_type        : <0x99>
    <ef8>   DW_AT_artificial  : 1
 <5><ef8>: Abbrev Number: 0
 <4><ef9>: Abbrev Number: 22 (DW_TAG_subprogram)
    <efa>   DW_AT_external    : 1
    <efa>   DW_AT_name        : (indirect string, offset: 0xfe4): swap
    <efe>   DW_AT_decl_file   : 24
    <efe>   DW_AT_decl_line   : 143
    <eff>   DW_AT_decl_column : 7
    <eff>   DW_AT_linkage_name: (indirect string, offset: 0x21e): _ZNSt15__exception_ptr13exception_ptr4swapERS0_
    <f03>   DW_AT_accessibility: 1	(public)
    <f03>   DW_AT_declaration : 1
    <f03>   DW_AT_object_pointer: <0xf0b>
    <f07>   DW_AT_sibling     : <0xf16>
 <5><f0b>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f0c>   DW_AT_type        : <0x1f62>
    <f10>   DW_AT_artificial  : 1
 <5><f10>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f11>   DW_AT_type        : <0x1f77>
 <5><f15>: Abbrev Number: 0
 <4><f16>: Abbrev Number: 67 (DW_TAG_subprogram)
    <f17>   DW_AT_external    : 1
    <f17>   DW_AT_name        : (indirect string, offset: 0xdaf): operator bool
    <f1b>   DW_AT_decl_file   : 24
    <f1c>   DW_AT_decl_line   : 155
    <f1d>   DW_AT_decl_column : 16
    <f1e>   DW_AT_linkage_name: (indirect string, offset: 0x28e): _ZNKSt15__exception_ptr13exception_ptrcvbEv
    <f22>   DW_AT_type        : <0x86d>
    <f26>   DW_AT_accessibility: 1	(public)
    <f27>   DW_AT_declaration : 1
    <f27>   DW_AT_explicit    : 1
    <f27>   DW_AT_object_pointer: <0xf2f>
    <f2b>   DW_AT_sibling     : <0xf35>
 <5><f2f>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f30>   DW_AT_type        : <0x1f67>
    <f34>   DW_AT_artificial  : 1
 <5><f34>: Abbrev Number: 0
 <4><f35>: Abbrev Number: 68 (DW_TAG_subprogram)
    <f36>   DW_AT_external    : 1
    <f36>   DW_AT_name        : (indirect string, offset: 0xbf0): __cxa_exception_type
    <f3a>   DW_AT_decl_file   : 24
    <f3b>   DW_AT_decl_line   : 176
    <f3c>   DW_AT_decl_column : 7
    <f3d>   DW_AT_linkage_name: (indirect string, offset: 0xdbd): _ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv
    <f41>   DW_AT_type        : <0x1f7c>
    <f45>   DW_AT_accessibility: 1	(public)
    <f46>   DW_AT_declaration : 1
    <f46>   DW_AT_object_pointer: <0xf4a>
 <5><f4a>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f4b>   DW_AT_type        : <0x1f67>
    <f4f>   DW_AT_artificial  : 1
 <5><f4f>: Abbrev Number: 0
 <4><f50>: Abbrev Number: 0
 <3><f51>: Abbrev Number: 14 (DW_TAG_const_type)
    <f52>   DW_AT_type        : <0xda4>
 <3><f56>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <f57>   DW_AT_decl_file   : 24
    <f58>   DW_AT_decl_line   : 84
    <f59>   DW_AT_decl_column : 16
    <f5a>   DW_AT_import      : <0xf67>	[Abbrev Number: 69 (DW_TAG_subprogram)]
 <3><f5e>: Abbrev Number: 0
 <2><f5f>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <f60>   DW_AT_decl_file   : 24
    <f61>   DW_AT_decl_line   : 68
    <f62>   DW_AT_decl_column : 26
    <f63>   DW_AT_import      : <0xda4>	[Abbrev Number: 64 (DW_TAG_class_type)]
 <2><f67>: Abbrev Number: 69 (DW_TAG_subprogram)
    <f68>   DW_AT_external    : 1
    <f68>   DW_AT_name        : (indirect string, offset: 0xb61): rethrow_exception
    <f6c>   DW_AT_decl_file   : 24
    <f6d>   DW_AT_decl_line   : 80
    <f6e>   DW_AT_decl_column : 8
    <f6f>   DW_AT_linkage_name: (indirect string, offset: 0xf40): _ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE
    <f73>   DW_AT_noreturn    : 1
    <f73>   DW_AT_declaration : 1
    <f73>   DW_AT_sibling     : <0xf7d>
 <3><f77>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f78>   DW_AT_type        : <0xda4>
 <3><f7c>: Abbrev Number: 0
 <2><f7d>: Abbrev Number: 26 (DW_TAG_typedef)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x386): nullptr_t
    <f82>   DW_AT_decl_file   : 25
    <f83>   DW_AT_decl_line   : 284
    <f85>   DW_AT_decl_column : 29
    <f86>   DW_AT_type        : <0x5ef>
 <2><f8a>: Abbrev Number: 70 (DW_TAG_class_type)
    <f8b>   DW_AT_name        : (indirect string, offset: 0xc2c): type_info
    <f8f>   DW_AT_declaration : 1
 <2><f8f>: Abbrev Number: 14 (DW_TAG_const_type)
    <f90>   DW_AT_type        : <0xf8a>
 <2><f94>: Abbrev Number: 45 (DW_TAG_namespace)
    <f95>   DW_AT_name        : (indirect string, offset: 0x26): __debug
    <f99>   DW_AT_decl_file   : 26
    <f9a>   DW_AT_decl_line   : 50
    <f9b>   DW_AT_decl_column : 13
 <2><f9c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <f9d>   DW_AT_decl_file   : 27
    <f9e>   DW_AT_decl_line   : 47
    <f9f>   DW_AT_decl_column : 11
    <fa0>   DW_AT_import      : <0x186>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fa4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fa5>   DW_AT_decl_file   : 27
    <fa6>   DW_AT_decl_line   : 48
    <fa7>   DW_AT_decl_column : 11
    <fa8>   DW_AT_import      : <0x192>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fac>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fad>   DW_AT_decl_file   : 27
    <fae>   DW_AT_decl_line   : 49
    <faf>   DW_AT_decl_column : 11
    <fb0>   DW_AT_import      : <0x19e>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fb4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fb5>   DW_AT_decl_file   : 27
    <fb6>   DW_AT_decl_line   : 50
    <fb7>   DW_AT_decl_column : 11
    <fb8>   DW_AT_import      : <0x1aa>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fbc>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fbd>   DW_AT_decl_file   : 27
    <fbe>   DW_AT_decl_line   : 52
    <fbf>   DW_AT_decl_column : 11
    <fc0>   DW_AT_import      : <0x246>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fc4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fc5>   DW_AT_decl_file   : 27
    <fc6>   DW_AT_decl_line   : 53
    <fc7>   DW_AT_decl_column : 11
    <fc8>   DW_AT_import      : <0x252>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fcc>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fcd>   DW_AT_decl_file   : 27
    <fce>   DW_AT_decl_line   : 54
    <fcf>   DW_AT_decl_column : 11
    <fd0>   DW_AT_import      : <0x25e>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fd4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fd5>   DW_AT_decl_file   : 27
    <fd6>   DW_AT_decl_line   : 55
    <fd7>   DW_AT_decl_column : 11
    <fd8>   DW_AT_import      : <0x26a>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fdc>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fdd>   DW_AT_decl_file   : 27
    <fde>   DW_AT_decl_line   : 57
    <fdf>   DW_AT_decl_column : 11
    <fe0>   DW_AT_import      : <0x1e6>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fe4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fe5>   DW_AT_decl_file   : 27
    <fe6>   DW_AT_decl_line   : 58
    <fe7>   DW_AT_decl_column : 11
    <fe8>   DW_AT_import      : <0x1f2>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><fec>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <fed>   DW_AT_decl_file   : 27
    <fee>   DW_AT_decl_line   : 59
    <fef>   DW_AT_decl_column : 11
    <ff0>   DW_AT_import      : <0x1fe>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><ff4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <ff5>   DW_AT_decl_file   : 27
    <ff6>   DW_AT_decl_line   : 60
    <ff7>   DW_AT_decl_column : 11
    <ff8>   DW_AT_import      : <0x20a>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><ffc>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <ffd>   DW_AT_decl_file   : 27
    <ffe>   DW_AT_decl_line   : 62
    <fff>   DW_AT_decl_column : 11
    <1000>   DW_AT_import      : <0x2be>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><1004>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1005>   DW_AT_decl_file   : 27
    <1006>   DW_AT_decl_line   : 63
    <1007>   DW_AT_decl_column : 11
    <1008>   DW_AT_import      : <0x2a6>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><100c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <100d>   DW_AT_decl_file   : 27
    <100e>   DW_AT_decl_line   : 65
    <100f>   DW_AT_decl_column : 11
    <1010>   DW_AT_import      : <0x1b6>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><1014>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1015>   DW_AT_decl_file   : 27
    <1016>   DW_AT_decl_line   : 66
    <1017>   DW_AT_decl_column : 11
    <1018>   DW_AT_import      : <0x1c2>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><101c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <101d>   DW_AT_decl_file   : 27
    <101e>   DW_AT_decl_line   : 67
    <101f>   DW_AT_decl_column : 11
    <1020>   DW_AT_import      : <0x1ce>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><1024>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1025>   DW_AT_decl_file   : 27
    <1026>   DW_AT_decl_line   : 68
    <1027>   DW_AT_decl_column : 11
    <1028>   DW_AT_import      : <0x1da>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><102c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <102d>   DW_AT_decl_file   : 27
    <102e>   DW_AT_decl_line   : 70
    <102f>   DW_AT_decl_column : 11
    <1030>   DW_AT_import      : <0x276>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><1034>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1035>   DW_AT_decl_file   : 27
    <1036>   DW_AT_decl_line   : 71
    <1037>   DW_AT_decl_column : 11
    <1038>   DW_AT_import      : <0x282>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><103c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <103d>   DW_AT_decl_file   : 27
    <103e>   DW_AT_decl_line   : 72
    <103f>   DW_AT_decl_column : 11
    <1040>   DW_AT_import      : <0x28e>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><1044>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1045>   DW_AT_decl_file   : 27
    <1046>   DW_AT_decl_line   : 73
    <1047>   DW_AT_decl_column : 11
    <1048>   DW_AT_import      : <0x29a>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><104c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <104d>   DW_AT_decl_file   : 27
    <104e>   DW_AT_decl_line   : 75
    <104f>   DW_AT_decl_column : 11
    <1050>   DW_AT_import      : <0x216>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><1054>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1055>   DW_AT_decl_file   : 27
    <1056>   DW_AT_decl_line   : 76
    <1057>   DW_AT_decl_column : 11
    <1058>   DW_AT_import      : <0x222>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><105c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <105d>   DW_AT_decl_file   : 27
    <105e>   DW_AT_decl_line   : 77
    <105f>   DW_AT_decl_column : 11
    <1060>   DW_AT_import      : <0x22e>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><1064>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1065>   DW_AT_decl_file   : 27
    <1066>   DW_AT_decl_line   : 78
    <1067>   DW_AT_decl_column : 11
    <1068>   DW_AT_import      : <0x23a>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><106c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <106d>   DW_AT_decl_file   : 27
    <106e>   DW_AT_decl_line   : 80
    <106f>   DW_AT_decl_column : 11
    <1070>   DW_AT_import      : <0x2ca>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><1074>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1075>   DW_AT_decl_file   : 27
    <1076>   DW_AT_decl_line   : 81
    <1077>   DW_AT_decl_column : 11
    <1078>   DW_AT_import      : <0x2b2>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><107c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <107d>   DW_AT_decl_file   : 28
    <107e>   DW_AT_decl_line   : 53
    <107f>   DW_AT_decl_column : 11
    <1080>   DW_AT_import      : <0x1f96>	[Abbrev Number: 32 (DW_TAG_structure_type)]
 <2><1084>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1085>   DW_AT_decl_file   : 28
    <1086>   DW_AT_decl_line   : 54
    <1087>   DW_AT_decl_column : 11
    <1088>   DW_AT_import      : <0x20dc>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><108c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <108d>   DW_AT_decl_file   : 28
    <108e>   DW_AT_decl_line   : 55
    <108f>   DW_AT_decl_column : 11
    <1090>   DW_AT_import      : <0x20f7>	[Abbrev Number: 49 (DW_TAG_subprogram)]
 <2><1094>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <1095>   DW_AT_decl_file   : 29
    <1096>   DW_AT_decl_line   : 98
    <1097>   DW_AT_decl_column : 11
    <1098>   DW_AT_import      : <0x54e>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><109c>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <109d>   DW_AT_decl_file   : 29
    <109e>   DW_AT_decl_line   : 99
    <109f>   DW_AT_decl_column : 11
    <10a0>   DW_AT_import      : <0x5af>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><10a4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <10a5>   DW_AT_decl_file   : 29
    <10a6>   DW_AT_decl_line   : 101
    <10a7>   DW_AT_decl_column : 11
    <10a8>   DW_AT_import      : <0x2108>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><10ac>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <10ad>   DW_AT_decl_file   : 29
    <10ae>   DW_AT_decl_line   : 102
    <10af>   DW_AT_decl_column : 11
    <10b0>   DW_AT_import      : <0x211b>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><10b4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <10b5>   DW_AT_decl_file   : 29
    <10b6>   DW_AT_decl_line   : 103
    <10b7>   DW_AT_decl_column : 11
    <10b8>   DW_AT_import      : <0x2131>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><10bc>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <10bd>   DW_AT_decl_file   : 29
    <10be>   DW_AT_decl_line   : 104
    <10bf>   DW_AT_decl_column : 11
    <10c0>   DW_AT_import      : <0x2148>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><10c4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <10c5>   DW_AT_decl_file   : 29
    <10c6>   DW_AT_decl_line   : 105
    <10c7>   DW_AT_decl_column : 11
    <10c8>   DW_AT_import      : <0x215f>	[Abbrev Number: 7 (DW_TAG_subprogram)]
 <2><10cc>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <10cd>   DW_AT_decl_file   : 29
    <10ce>   DW_AT_decl_line   : 106
    <10cf>   DW_AT_decl_column : 11
    <10d0>   DW_AT_import      : <0x2175>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><10d4>: Abbrev Number: 2 (DW_TAG_imported_declaration)
    <10d5>   DW_AT_decl_file   : 29
    <10d6>   DW_AT_decl_line   : 107
    <10d7>   DW_AT_decl_column : 11
    <10d8>   DW_AT_import      : <0x218c>	[Abbrev Number: 3 (DW_TAG_subprogram)]
 <2><10dc>: Abbrev Number: 2 (DW_TAG_imported_declaration)
